aroyer-qc/Digini/Peripheral/inc/port/STM32H7xx/lib_STM32H7_system_clock.h
//-------------------------------------------------------------------------------------------------
//
//  File : lib_STM32H7_system_clock.h
//
//-------------------------------------------------------------------------------------------------
//
// Copyright(c) 2025 Alain Royer.
// Email: aroyer.qc@gmail.com
//
// Permission is hereby granted, free of charge, to any person obtaining a copy of this software
// and associated documentation files (the "Software"), to deal in the Software without
// restriction, including without limitation the rights to use, copy, modify, merge, publish,
// distribute, sublicense, and/or sell copies of the Software, and to permit persons to whom the
// Software is furnished to do so, subject to the following conditions:
//
// The above copyright notice and this permission notice shall be included in all copies or
// substantial portions of the Software.
//
// THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR IMPLIED,
// INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE
// AND NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM,
// DAMAGES OR OTHER LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
// OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE SOFTWARE.
//
//-------------------------------------------------------------------------------------------------

#pragma once

//-------------------------------------------------------------------------------------------------
// Include(s)
//-------------------------------------------------------------------------------------------------

#include "stm32h7xx.h"
#include <stdbool.h>
#include "./Digini/inc/lib_macro.h"

//-------------------------------------------------------------------------------------------------
// Macro(s)
//-------------------------------------------------------------------------------------------------

//#define XSTR(x) STR(x)
//#define STR(x) #x

//-------------------------------------------------------------------------------------------------
// Define(s)
//-------------------------------------------------------------------------------------------------

#ifdef STM32H735xx
    #define MAX_SYS_HCLK                        550000000
    #define MAX_SYS_AXI                         275000000
    #define MAX_PCLK1                           137500000
    #define MAX_PCLK2                           137500000
    #define MAX_PCLK3                           137500000
    #define MAX_PCLK4                           137500000
    #define MAX_AHB4                            275000000
    #define VCOSEL_FREQUENCY                    2000000                         // Higher than this PLLx_VCOSEL is 0, otherwise it is 1

    #define MIN_DIVM1                           1
    #define MAX_DIVM1                           63
    #define MIN_MULN1                           4
    #define MAX_MULN1                           512
    #define MIN_DIVP1                           1
    #define MAX_DIVP1                           128
    #define MIN_DIVQ1                           1
    #define MAX_DIVQ1                           128
    #define MIN_DIVR1                           1
    #define MAX_DIVR1                           128

    #define MIN_DIVM2                           1
    #define MAX_DIVM2                           63
    #define MIN_MULN2                           4
    #define MAX_MULN2                           512
    #define MIN_DIVP2                           1
    #define MAX_DIVP2                           128
    #define MIN_DIVQ2                           1
    #define MAX_DIVQ2                           128
    #define MIN_DIVR2                           1
    #define MAX_DIVR2                           128

    #define MIN_DIVM3                           1
    #define MAX_DIVM3                           63
    #define MIN_MULN3                           4
    #define MAX_MULN3                           512
    #define MIN_DIVP3                           1
    #define MAX_DIVP3                           128
    #define MIN_DIVQ3                           1
    #define MAX_DIVQ3                           128
    #define MIN_DIVR3                           1
    #define MAX_DIVR3                           128
#endif

#ifdef STM32H745xx
    #define MAX_SYS_HCLK                        480000000
    #define MAX_SYS_AXI                         240000000
    #define MAX_PCLK1                           120000000
    #define MAX_PCLK2                           120000000
    #define MAX_PCLK3                           120000000
    #define MAX_PCLK4                           120000000
    #define MAX_AHB4                            240000000
    #define VCOSEL_FREQUENCY                    2000000

    #define MIN_DIVM1                           1
    #define MAX_DIVM1                           63
    #define MIN_MULN1                           4
    #define MAX_MULN1                           512
    #define MIN_DIVP1                           2
    #define MAX_DIVP1                           128
    #define MIN_DIVQ1                           1
    #define MAX_DIVQ1                           128
    #define MIN_DIVR1                           1
    #define MAX_DIVR1                           128

    #define MIN_DIVM2                           1
    #define MAX_DIVM2                           63
    #define MIN_MULN2                           4
    #define MAX_MULN2                           512
    #define MIN_DIVP2                           1
    #define MAX_DIVP2                           128
    #define MIN_DIVQ2                           1
    #define MAX_DIVQ2                           128
    #define MIN_DIVR2                           1
    #define MAX_DIVR2                           128

    #define MIN_DIVM3                           1
    #define MAX_DIVM3                           63
    #define MIN_MULN3                           4
    #define MAX_MULN3                           512
    #define MIN_DIVP3                           1
    #define MAX_DIVP3                           128
    #define MIN_DIVQ3                           1
    #define MAX_DIVQ3                           128
    #define MIN_DIVR3                           1
    #define MAX_DIVR3                           128
#endif

#ifdef STM32H7B3xx
    #define MAX_SYS_HCLK                        280000000
    #define MAX_SYS_AXI                         140000000
    #define MAX_PCLK1                           140000000
    #define MAX_PCLK2                           140000000
    #define MAX_PCLK3                           140000000
    #define MAX_PCLK4                           140000000
    #define MAX_AHB4                            140000000
    #define VCOSEL_FREQUENCY                    2000000

    #define MIN_DIVM1                           1
    #define MAX_DIVM1                           63
    #define MIN_MULN1                           8
    #define MAX_MULN1                           420
    #define MIN_DIVP1                           2
    #define MAX_DIVP1                           128
    #define MIN_DIVQ1                           1
    #define MAX_DIVQ1                           128
    #define MIN_DIVR1                           1
    #define MAX_DIVR1                           128

    #define MIN_DIVM2                           1
    #define MAX_DIVM2                           63
    #define MIN_MULN2                           8
    #define MAX_MULN2                           420
    #define MIN_DIVP2                           1
    #define MAX_DIVP2                           128
    #define MIN_DIVQ2                           1
    #define MAX_DIVQ2                           128
    #define MIN_DIVR2                           1
    #define MAX_DIVR2                           128

    #define MIN_DIVM3                           1
    #define MAX_DIVM3                           63
    #define MIN_MULN3                           8
    #define MAX_MULN3                           420
    #define MIN_DIVP3                           1
    #define MAX_DIVP3                           128
    #define MIN_DIVQ3                           1
    #define MAX_DIVQ3                           128
    #define MIN_DIVR3                           1
    #define MAX_DIVR3                           128
#endif

#define LSI_CLOCK_FREQUENCY                     32000
#define HSI_RC_CLOCK_FREQUENCY                  64000000
#define CSI_CLOCK_FREQUENCY                     4000000
#define RC48_CLOCK_FREQUENCY                    48000000

//-------------------------------------------------------------------------------------------------
// Multiplexer for peripheral clock source

// System clock MUX selection
#define CFG_RCC_CFGR_SW_HSI                     0x00000000
#define CFG_RCC_CFGR_SW_CSI                     0x00000001
#define CFG_RCC_CFGR_SW_HSE                     0x00000002
#define CFG_RCC_CFGR_SW_PLL1                    0x00000003

/// Multiplexer define to be used for ADC clock source                                                  -> CFG_ADC_SOURCE_MUX           default: PLL2P
#if defined(RCC_D3CCIPR_ADCSEL_0)
  #define CFG_ADC_PLL2P                         0
  #define CFG_ADC_PLL3R                         RCC_D3CCIPR_ADCSEL_0
  #define CFG_ADC_PER_CLK                       RCC_D3CCIPR_ADCSEL_1
#else
  #define CFG_ADC_PLL2P                         0
  #define CFG_ADC_PLL3R                         RCC_SRDCCIPR_ADCSEL_0
  #define CFG_ADC_PER_CLK                       RCC_SRDCCIPR_ADCSEL_1
#endif

