aroyer-qc/Digini/Peripheral/inc/port/STM32H7xx/lib_STM32H7_system_clock.h
/// Multiplexer define to be used for HDMI CEC clock source                                             -> CFG_CEC_SOURCE_MUX           default: LSE
#if defined(RCC_D2CCIP2R_CECSEL_0)
  #define CFG_CEC_LSE                           0
  #define CFG_CEC_LSI                           RCC_D2CCIP2R_CECSEL_0
  #define CFG_CEC_CSI                           RCC_D2CCIP2R_CECSEL_1
#else
  #define CFG_CEC_LSE                           0
  #define CFG_CEC_LSI                           RCC_CDCCIP2R_CECSEL_0
  #define CFG_CEC_CSI                           RCC_CDCCIP2R_CECSEL_1
#endif

/// Multiplexer define to be used for DFSDM1 clock source                                               -> CFG_DFSDM1_SOURCE_MUX         default: PCLK2
#if defined(RCC_D2CCIP1R_DFSDM1SEL)
  #define CFG_DFSDM1_PLCK2                      0
  #define CFG_DFSDM1_SYSCLK                     RCC_D2CCIP1R_DFSDM1SEL
#else
  #define CFG_DFSDM1_PLCK2                      0
  #define CFG_DFSDM1_SYSCLK                     RCC_CDCCIP1R_DFSDM1SEL
#endif

/// Multiplexer define to be used for DFSDM2 clock source                                               -> CFG_DFSDM2_SOURCE_MUX         default: PCLK4
#if defined(DFSDM2)
  #define CFG_DFSDM2_PLCK4                      0
  #define CFG_DFSDM2_SYSCLK                     RCC_SRDCCIPR_DFSDM2SEL
#endif

/// Multiplexer define to be used for DFSDM clock source                                                -> CFG_DFSDM_SOURCE_MUX         default: PCLK2
#if defined(RCC_D2CCIP1R_DFSDM1SEL)
  #define CFG_DFSDM_PLCK2                         0
  #define CFG_DFSDM_SYSCLK                        RCC_D2CCIP1R_DFSDM1SEL
#else
  #define CFG_DFSDM_PLCK2                         0
  #define CFG_DFSDM_SYSCLK                        RCC_CDCCIP1R_DFSDM1SEL
#endif

/// Multiplexer define to be used for FDCAN clock source                                                -> CFG_FDCAN_SOURCE_MUX         default: HSE
#if defined(FDCAN1) || defined(FDCAN2)
 #if defined(RCC_D2CCIP1R_FDCANSEL)
  #define CFG_FDCAN_HSE                         0
  #define CFG_FDCAN_PLL1Q                       RCC_D2CCIP1R_FDCANSEL_0
  #define CFG_FDCAN_PLL2Q                       RCC_D2CCIP1R_FDCANSEL_1
 #else
  #define CFG_FDCAN_HSE                         0
  #define CFG_FDCAN_PLL1Q                       RCC_CDCCIP1R_FDCANSEL_0
  #define CFG_FDCAN_PLL2Q                       RCC_CDCCIP1R_FDCANSEL_1
 #endif
#endif

/// Multiplexer define to be used for FMC clock source                                                  -> CFG_FMC_SOURCE_MUX           default: HCLK3
#if defined(RCC_D1CCIPR_FMCSEL)
  #define CFG_FMC_HCLK3                           0
  #define CFG_FMC_PLL1Q                           RCC_D1CCIPR_FMCSEL_0
  #define CFG_FMC_PLL2R                           RCC_D1CCIPR_FMCSEL_1
  #define CFG_FMC_PER_CLK                         (RCC_D1CCIPR_FMCSEL_1 | RCC_D1CCIPR_FMCSEL_0)
#else
  #define CFG_FMC_HCLK3                           0
  #define CFG_FMC_PLL1Q                           RCC_CDCCIPR_FMCSEL_0
  #define CFG_FMC_PLL2R                           RCC_CDCCIPR_FMCSEL_1
  #define CFG_FMC_PER_CLK                         (RCC_CDCCIPR_FMCSEL_1 | RCC_CDCCIPR_FMCSEL_0)
#endif

#if defined (RCC_D2CCIP2R_I2C123SEL)
  /// Multiplexer define to be used for I2C123 clock source                                             -> CFG_I2C123_SOURCE_MUX        default: PCLK1
  #define CFG_I2C123_PCLK1                      0
  #define CFG_I2C123_PLL3R                      RCC_D2CCIP2R_I2C123SEL_0
  #define CFG_I2C123_HSI                        RCC_D2CCIP2R_I2C123SEL_1
  #define CFG_I2C123_CSI                        (RCC_D2CCIP2R_I2C123SEL_1 | RCC_D2CCIP2R_I2C123SEL_0)
#elif defined(RCC_CDCCIP2R_I2C123SEL)
  /// Multiplexer define to be used for I2C123 clock source                                             -> CFG_I2C123_SOURCE_MUX        default: PCLK1
  #define CFG_I2C123_PCLK1                      0
  #define CFG_I2C123_PLL3R                      RCC_CDCCIP2R_I2C123SEL_0
  #define CFG_I2C123_HSI                        RCC_CDCCIP2R_I2C123SEL_1
  #define CFG_I2C123_CSI                        (RCC_CDCCIP2R_I2C123SEL_1 | RCC_CDCCIP2R_I2C123SEL_0)
#elif defined(RCC_D2CCIP2R_I2C1235SEL)
  /// Multiplexer define to be used for I2C1235 clock source                                            -> CFG_I2C1235_SOURCE_MUX       default: PCLK1
  #define CFG_I2C1235_PCLK1                     0
  #define CFG_I2C1235_PLL3R                     RCC_D2CCIP2R_I2C1235SEL_0
  #define CFG_I2C1235_HSI                       RCC_D2CCIP2R_I2C1235SEL_1
  #define CFG_I2C1235_CSI                       (RCC_D2CCIP2R_I2C1235SEL_1 | RCC_D2CCIP2R_I2C1235SEL_0)
#endif

/// Multiplexer define to be used for I2C4 clock source                                                 -> CFG_I2C4_SOURCE_MUX          default: PCLK4
#if defined(RCC_D3CCIPR_I2C4SEL)
  #define CFG_I2C4_PCLK4                        0
  #define CFG_I2C4_PLL3R                        RCC_D3CCIPR_I2C4SEL_0
  #define CFG_I2C4_HSI                          RCC_D3CCIPR_I2C4SEL_1
  #define CFG_I2C4_CSI                          (RCC_D3CCIPR_I2C4SEL_1 | RCC_D3CCIPR_I2C4SEL_0)
#else
  #define CFG_I2C4_PCLK4                        0
  #define CFG_I2C4_PLL3R                        RCC_SRDCCIPR_I2C4SEL_0
  #define CFG_I2C4_HSI                          RCC_SRDCCIPR_I2C4SEL_1
  #define CFG_I2C4_CSI                          (RCC_SRDCCIPR_I2C4SEL_1 | RCC_SRDCCIPR_I2C4SEL_0)
#endif

/// Multiplexer define to be used for HRTIM clock source                                                -> CFG_HRTIM_SOURCE_MUX         default: TIM_CLK
#if defined(HRTIM1)
  #define CFG_HRTIM_TIM_CLK                     0
  #define CFG_HRTIM_CPU1_CLK                    RCC_CFGR_HRTIMSEL
#endif

/// Multiplexer define to be used for LPTIM1 clock source                                               -> CFG_LPTIM1_SOURCE_MUX        default: PCLK1
#if defined(RCC_D2CCIP2R_LPTIM1SEL)
  #define CFG_LPTIM1_PCLK1                      0
  #define CFG_LPTIM1_PLL2P                      RCC_D2CCIP2R_LPTIM1SEL_0
  #define CFG_LPTIM1_PLL3R                      RCC_D2CCIP2R_LPTIM1SEL_1
  #define CFG_LPTIM1_LSE                        (RCC_D2CCIP2R_LPTIM1SEL_1 | RCC_D2CCIP2R_LPTIM1SEL_0)
  #define CFG_LPTIM1_LSI                        RCC_D2CCIP2R_LPTIM1SEL_2
  #define CFG_LPTIM1_PER_CLK                    (RCC_D2CCIP2R_LPTIM1SEL_2 | RCC_D2CCIP2R_LPTIM1SEL_0)
#else
  #define CFG_LPTIM1_PCLK1                      0
  #define CFG_LPTIM1_PLL2P                      RCC_CDCCIP2R_LPTIM1SEL_0
  #define CFG_LPTIM1_PLL3R                      RCC_CDCCIP2R_LPTIM1SEL_1
  #define CFG_LPTIM1_LSE                        (RCC_CDCCIP2R_LPTIM1SEL_1 | RCC_CDCCIP2R_LPTIM1SEL_0)
  #define CFG_LPTIM1_LSI                        RCC_CDCCIP2R_LPTIM1SEL_2
  #define CFG_LPTIM1_PER_CLK                    (RCC_CDCCIP2R_LPTIM1SEL_2 | RCC_CDCCIP2R_LPTIM1SEL_0)
#endif

/// Multiplexer define to be used for LPTIM2 clock source                                               -> CFG_LPTIM2_SOURCE_MUX        default: PCLK4
#if defined(RCC_D3CCIPR_LPTIM2SEL)
  #define CFG_LPTIM2_PCLK4                      0
  #define CFG_LPTIM2_PLL2P                      RCC_D3CCIPR_LPTIM2SEL_0
  #define CFG_LPTIM2_PLL3R                      RCC_D3CCIPR_LPTIM2SEL_1
  #define CFG_LPTIM2_LSE                        (RCC_D3CCIPR_LPTIM2SEL_1 | RCC_D3CCIPR_LPTIM2SEL_0)
  #define CFG_LPTIM2_LSI                        RCC_D3CCIPR_LPTIM2SEL_2
  #define CFG_LPTIM2_PER_CLK                    (RCC_D3CCIPR_LPTIM2SEL_2 | RCC_D3CCIPR_LPTIM2SEL_0)
#else
  #define CFG_LPTIM2_PCLK4                      0
  #define CFG_LPTIM2_PLL2P                      RCC_SRDCCIPR_LPTIM2SEL_0
  #define CFG_LPTIM2_PLL3R                      RCC_SRDCCIPR_LPTIM2SEL_1
  #define CFG_LPTIM2_LSE                        (RCC_SRDCCIPR_LPTIM2SEL_1 | RCC_SRDCCIPR_LPTIM2SEL_0)
  #define CFG_LPTIM2_LSI                        RCC_SRDCCIPR_LPTIM2SEL_2
  #define CFG_LPTIM2_PER_CLK                    (RCC_SRDCCIPR_LPTIM2SEL_2 | RCC_SRDCCIPR_LPTIM2SEL_0)
#endif

/// Multiplexer define to be used for LPTIM3, LPTIM4, LPTIM5 clock source                               -> CFG_LPTIM345_SOURCE_MUX      default:PCLK4
#if defined(RCC_D3CCIPR_LPTIM345SEL)
  #define CFG_LPTIM345_PCLK4                    0
  #define CFG_LPTIM345_PLL2P                    RCC_D3CCIPR_LPTIM345SEL_0
  #define CFG_LPTIM345_PLL3R                    RCC_D3CCIPR_LPTIM345SEL_1
  #define CFG_LPTIM345_LSE                      (RCC_D3CCIPR_LPTIM345SEL_1 | RCC_D3CCIPR_LPTIM345SEL_0)
  #define CFG_LPTIM345_LSI                      RCC_D3CCIPR_LPTIM345SEL_2
  #define CFG_LPTIM345_PER_CLK                  (RCC_D3CCIPR_LPTIM345SEL_2 | RCC_D3CCIPR_LPTIM345SEL_0)
#else
  #define CFG_LPTIM345_PCLK4                    0
  #define CFG_LPTIM345_PLL2P                    RCC_SRDCCIPRLPTIM345SEL_0
  #define CFG_LPTIM345_PLL3R                    RCC_SRDCCIPRLPTIM345SEL_1
  #define CFG_LPTIM345_LSE                      (RCC_SRDCCIPRLPTIM345SEL_1 | RCC_SRDCCIPRLPTIM345SEL_0)
  #define CFG_LPTIM345_LSI                      RCC_SRDCCIPRLPTIM345SEL_2
  #define CFG_LPTIM345_PER_CLK                  (RCC_SRDCCIPRLPTIM345SEL_2 | RCC_SRDCCIPRLPTIM345SEL_0)
#endif

/// Multiplexer define to be used for LPUART1 clock source                                              -> CFG_LPUART1_SOURCE_MUX       default: PCLK3
#if defined(RCC_D3CCIPR_LPUART1SEL)
  #define CFG_LPUART1_PCLK3                     0           // TODO check this as file say PCLK4 but IDE say PCLK3
  #define CFG_LPUART1_PLL2Q                     RCC_D3CCIPR_LPUART1SEL_0
  #define CFG_LPUART1_PLL3Q                     RCC_D3CCIPR_LPUART1SEL_1
  #define CFG_LPUART1_HSI                       (RCC_D3CCIPR_LPUART1SEL_1 | RCC_D3CCIPR_LPUART1SEL_0)
  #define CFG_LPUART1_CSI                       RCC_D3CCIPR_LPUART1SEL_2
  #define CFG_LPUART1_LSE                       (RCC_D3CCIPR_LPUART1SEL_2 | RCC_D3CCIPR_LPUART1SEL_0)
#else
  #define CFG_LPUART1_PCLK3                     0
  #define CFG_LPUART1_PLL2Q                     RCC_SRDCCIPR_LPUART1SEL_0
  #define CFG_LPUART1_PLL3Q                     RCC_SRDCCIPR_LPUART1SEL_1
  #define CFG_LPUART1_HSI                       (RCC_SRDCCIPR_LPUART1SEL_1 | RCC_SRDCCIPR_LPUART1SEL_0)
  #define CFG_LPUART1_CSI                       RCC_SRDCCIPR_LPUART1SEL_2
  #define CFG_LPUART1_LSE                       (RCC_SRDCCIPR_LPUART1SEL_2 | RCC_SRDCCIPR_LPUART1SEL_0)
#endif

/// Multiplexer define to be used for MCO1 clock source                                                 -> CFG_MCO1_SOURCE_MUX          default: SYS_CLK
#define CFG_MCO1_SYS_CLK                        0
#define CFG_MCO1_HSI                            RCC_CFGR_MCO1SEL_0
#define CFG_MCO1_LSE                            RCC_CFGR_MCO1SEL_1
#define CFG_MCO1_HSE                            (RCC_CFGR_MCO1SEL_1 | RCC_CFGR_MCO1SEL_0)
#define CFG_MCO1_PLL1Q                          RCC_CFGR_MCO1SEL_2
#define CFG_MCO1_HSI48                          (RCC_CFGR_MCO1SEL_2 | RCC_CFGR_MCO1SEL_0)

/// Multiplexer define to be used for MCO2 clock source                                                 -> CFG_MCO2_SOURCE_MUX          default: SYS_CLK
#define CFG_MCO2_SYS_CLK                        0
#define CFG_MCO2_PLL2P                          RCC_CFGR_MCO2SEL_0
#define CFG_MCO2_HSE                            RCC_CFGR_MCO2SEL_1
#define CFG_MCO2_PLL1P                          (RCC_CFGR_MCO2SEL_1 | RCC_CFGR_MCO2SEL_0)
#define CFG_MCO2_CSI                            RCC_CFGR_MCO2SEL_2
#define CFG_MCO2_LSI                            (RCC_CFGR_MCO2SEL_2 | RCC_CFGR_MCO2SEL_0)

