aroyer-qc/Digini/Peripheral/inc/port/STM32H7xx/lib_STM32H7_system_clock.h
/// Multiplexer define to be used for PERIPHERAL clock source                                           -> CFG_PER_SOURCE_MUX           default: HSI
#if defined(RCC_D1CCIPR_CKPERSEL_0)
  #define CFG_PER_HSI_KER                         0
  #define CFG_PER_CSI_KER                         RCC_D1CCIPR_CKPERSEL_0
  #define CFG_PER_HSE_KER                         RCC_D1CCIPR_CKPERSEL_1
#else
  #define CFG_PER_HSI_KER                         0
  #define CFG_PER_CSI_KER                         RCC_CDCCIPR_CKPERSEL_0
  #define CFG_PER_HSE_KER                         RCC_CDCCIPR_CKPERSEL_1
#endif

#if defined(QUADSPI)
/// Multiplexer define to be used for QUADSPI clock source                                              -> CFG_QSPI_SOURCE_MUX          default: PLL1Q
  #define CFG_QSPI_HCLK3                        0
  #define CFG_QSPI_PLL1Q                        RCC_D1CCIPR_QSPISEL_0
  #define CFG_QSPI_PLL2R                        RCC_D1CCIPR_QSPISEL_1
  #define CFG_QSPI_PER_CLK                      (RCC_D1CCIPR_QSPISEL_1 | RCC_D1CCIPR_QSPISEL_0)
#endif

/// Multiplexer define to be used for OCTOSPI clock source                                              -> CFG_OSPI_SOURCE_MUX          default: PLL1Q
#if defined(OCTOSPI1) || defined(OCTOSPI2)
 #if defined (RCC_D1CCIPR_OCTOSPISEL)
  #define CFG_OSPI_HCLK3                        0
  #define CFG_OSPI_PLL1Q                        RCC_D1CCIPR_OCTOSPISEL_0
  #define CFG_OSPI_PLL2R                        RCC_D1CCIPR_OCTOSPISEL_1
  #define CFG_OSPI_PER_CLK                      (RCC_D1CCIPR_OCTOSPISEL_1 | RCC_CDCCIPR_OCTOSPISEL_0)
 #else
  #define CFG_OSPI_HCLK3                        0
  #define CFG_OSPI_PLL1Q                        RCC_CDCCIPR_OCTOSPISEL_0
  #define CFG_OSPI_PLL2R                        RCC_CDCCIPR_OCTOSPISEL_1
  #define CFG_OSPI_PER_CLK                      (RCC_CDCCIPR_OCTOSPISEL_1 | RCC_CDCCIPR_OCTOSPISEL_0)
 #endif
#endif

/// Multiplexer define to be used for RTC clock source                                                  -> CFG_QSPI_SOURCE_MUX          default: None
#define CFG_RTC_LSE                             RCC_BDCR_RTCSEL_0
#define CFG_RTC_LSI                             RCC_BDCR_RTCSEL_1
#define CFG_RTC_HSE                             (RCC_BDCR_RTCSEL_1 | RCC_BDCR_RTCSEL_0)

/// Multiplexer define to be used for RNG clock source                                                  -> CFG_RNG_SOURCE_MUX           default: HSI48
#if defined(RCC_D2CCIP2R_RNGSEL)
  #define CFG_RNG_HSI48                         0
  #define CFG_RNG_PLL1Q                         RCC_D2CCIP2R_RNGSEL_0
  #define CFG_RNG_LSE                           RCC_D2CCIP2R_RNGSEL_1
  #define CFG_RNG_LSI                           (RCC_D2CCIP2R_RNGSEL_1 | RCC_D2CCIP2R_RNGSEL_0)
#else
  #define CFG_RNG_HSI48                         0
  #define CFG_RNG_PLL1Q                         RCC_CDCCIP2R_RNGSEL_0
  #define CFG_RNG_LSE                           RCC_CDCCIP2R_RNGSEL_1
  #define CFG_RNG_LSI                           (RCC_CDCCIP2R_RNGSEL_1 | RCC_CDCCIP2R_RNGSEL_0)
#endif

/// Multiplexer define to be used for SAI1 clock source                                                 -> CFG_SAI1_SOURCE_MUX          default: PLL1Q
#if defined(RCC_D2CCIP1R_SAI1SEL)
  #define CFG_SAI1_PLL1Q                        0
  #define CFG_SAI1_PLL2P                        RCC_D2CCIP1R_SAI1SEL_0
  #define CFG_SAI1_PLL3P                        RCC_D2CCIP1R_SAI1SEL_1
  #define CFG_SAI1_I2SCKIN                      (RCC_D2CCIP1R_SAI1SEL_1 | RCC_D2CCIP1R_SAI1SEL_0)
  #define CFG_SAI1_PER_CLK                      RCC_D2CCIP1R_SAI1SEL_2
#else
  #define CFG_SAI1_PLL1Q                        0
  #define CFG_SAI1_PLL2P                        RCC_CDCCIP1R_SAI1SEL_0
  #define CFG_SAI1_PLL3P                        RCC_CDCCIP1R_SAI1SEL_1
  #define CFG_SAI1_I2SCKIN                      (RCC_CDCCIP1R_SAI1SEL_1 | RCC_CDCCIP1R_SAI1SEL_0)
  #define CFG_SAI1_PER_CLK                      RCC_CDCCIP1R_SAI1SEL_2
#endif

/// Multiplexer define to be used for SAI2, SAI3 clock source                                           -> CFG_SAI23_SOURCE_MUX         default: PLL1Q
#if defined(RCC_D2CCIP1R_SAI23SEL)
  #define CFG_SAI23_PLL1Q                       0
  #define CFG_SAI23_PLL2P                       RCC_D2CCIP1R_SAI23SEL_0
  #define CFG_SAI23_PLL3P                       RCC_D2CCIP1R_SAI23SEL_1
  #define CFG_SAI23_I2SCKIN                     (RCC_D2CCIP1R_SAI23SEL_1 | RCC_D2CCIP1R_SAI23SEL_0)
  #define CFG_SAI23_PER_CLK                     RCC_D2CCIP1R_SAI23SEL_2
#endif

/// Multiplexer define to be used for SAI2A clock source                                                -> CFG_SAI2A_SOURCE_MUX         default: PLL1Q
#if defined(RCC_CDCCIP1R_SAI2ASEL)
  #define CFG_SAI2A_PLL1Q                       0
  #define CFG_SAI2A_PLL2P                       RCC_CDCCIP1R_SAI2ASEL_0
  #define CFG_SAI2A_PLL3P                       RCC_CDCCIP1R_SAI2ASEL_1
  #define CFG_SAI2A_I2SCKIN                     (RCC_CDCCIP1R_SAI2ASEL_1 | RCC_CDCCIP1R_SAI2ASEL_0)
  #define CFG_SAI2A_PER_CLK                     RCC_CDCCIP1R_SAI2ASEL_2
#endif

/// Multiplexer define to be used for SAI2B clock source                                                -> CFG_SAI2B_SOURCE_MUX         default: PLL1Q
#if defined(RCC_CDCCIP1R_SAI2ASEL)
  #define CFG_SAI2B_PLL1Q                       0
  #define CFG_SAI2B_PLL2P                       RCC_CDCCIP1R_SAI2BSEL_0
  #define CFG_SAI2B_PLL3P                       RCC_CDCCIP1R_SAI2BSEL_1
  #define CFG_SAI2B_I2SCKIN                     (RCC_CDCCIP1R_SAI2BSEL_1 | RCC_CDCCIP1R_SAI2BSEL_0)
  #define CFG_SAI2B_PER_CLK                     RCC_CDCCIP1R_SAI2BSEL_2
#endif

/// Multiplexer define to be used for SAI4A clock source                                                -> CFG_SAI4B_SOURCE_MUX         default: PLL1Q
#if defined(RCC_D3CCIPR_SAI4ASEL)
  #define CFG_SAI4A_PLL1Q                         0
  #define CFG_SAI4A_PLL2P                         RCC_D3CCIPR_SAI4ASEL_0
  #define CFG_SAI4A_PLL3P                         RCC_D3CCIPR_SAI4ASEL_1
  #define CFG_SAI4A_I2SCKIN                       (RCC_D3CCIPR_SAI4ASEL_1 | RCC_D3CCIPR_SAI4ASEL_0)
  #define CFG_SAI4A_PER_CLK                       RCC_D3CCIPR_SAI4ASEL_2
  #define CFG_SAI4A_SPDIF                         (RCC_D3CCIPR_SAI4ASEL_2 | RCC_D3CCIPR_SAI4ASEL_0)     // Version 3.0 only
#endif

/// Multiplexer define to be used for SAI4B clock source                                               -> CFG_SAI4B_SOURCE_MUX         default: PLL1Q
#if defined(RCC_D3CCIPR_SAI4BSEL)
  #define CFG_SAI4B_PLL1Q                         0
  #define CFG_SAI4B_PLL2P                         RCC_D3CCIPR_SAI4BSEL_0
  #define CFG_SAI4B_PLL3P                         RCC_D3CCIPR_SAI4BSEL_1
  #define CFG_SAI4B_I2SCKIN                       (RCC_D3CCIPR_SAI4BSEL_1 | RCC_D3CCIPR_SAI4BSEL_0)
  #define CFG_SAI4B_PER_CLK                       RCC_D3CCIPR_SAI4BSEL_2
  #define CFG_SAI4B_SPDIF                         (RCC_D3CCIPR_SAI4BSEL_2 | RCC_D3CCIPR_SAI4BSEL_0)     // Version 3.0 only
#endif

