aroyer-qc/Digini/Peripheral/inc/port/STM32H7xx/lib_STM32H7_system_clock.h
///  Multiplexer define to be used for SDMMC clock source                                               -> CFG_SDMMC_SOURCE_MUX         default: PLLQ1
#if defined(RCC_D1CCIPR_SDMMCSEL)
  #define CFG_SDMMC_PLL1Q                       0
  #define CFG_SDMMC_PLL2R                       RCC_D1CCIPR_SDMMCSEL
#else
  #define CFG_SDMMC_PLL1Q                       0
  #define CFG_SDMMC_PLL2R                       RCC_CDCCIPR_SDMMCSEL
#endif

/// Multiplexer define to be used for SPDIF clock source                                                -> CFG_SPDIF_SOURCE_MUX         default: PLL1Q
#if defined(RCC_D2CCIP1R_SPDIFSEL_0)
  #define CFG_SPDIF_PLL1Q                       0
  #define CFG_SPDIF_PLL2R                       RCC_D2CCIP1R_SPDIFSEL_0
  #define CFG_SPDIF_PLL3R                       RCC_D2CCIP1R_SPDIFSEL_1
  #define CFG_SPDIF_HSI                         (RCC_D2CCIP1R_SPDIFSEL_1 | RCC_D2CCIP1R_SPDIFSEL_0)
#else
  #define CFG_SPDIF_PLL1Q                       0
  #define CFG_SPDIF_PLL2R                       RCC_CDCCIP1R_SPDIFSEL_0
  #define CFG_SPDIF_PLL3R                       RCC_CDCCIP1R_SPDIFSEL_1
  #define CFG_SPDIF_HSI                         (RCC_CDCCIP1R_SPDIFSEL_1 | RCC_CDCCIP1R_SPDIFSEL_0)
#endif

/// Multiplexer define to be used for SPI1, SPI2, SPI3 clock source                                     -> CFG_SPI123_SOURCE_MUX        default: PLL1Q
#if defined(RCC_D2CCIP1R_SPI123SEL)
  #define CFG_SPI123_PLL1Q                      0
  #define CFG_SPI123_PLL2P                      RCC_D2CCIP1R_SPI123SEL_0
  #define CFG_SPI123_PLL3P                      RCC_D2CCIP1R_SPI123SEL_1
  #define CFG_SPI123_I2SCKIN                    (RCC_D2CCIP1R_SPI123SEL_1 | RCC_D2CCIP1R_SPI123SEL_0)
  #define CFG_SPI123_PER_CLK                    RCC_D2CCIP1R_SPI123SEL_2
#else
  #define CFG_SPI123_PLL1Q                      0
  #define CFG_SPI123_PLL2P                      RCC_CDCCIP1R_SPI123SEL_0
  #define CFG_SPI123_PLL3P                      RCC_CDCCIP1R_SPI123SEL_1
  #define CFG_SPI123_I2SCKIN                    (RCC_CDCCIP1R_SPI123SEL_1 | RCC_CDCCIP1R_SPI123SEL_0)
  #define CFG_SPI123_PER_CLK                    RCC_CDCCIP1R_SPI123SEL_2
#endif

/// Multiplexer define to be used for SPI4, SPI5 clock source                                           -> CFG_SPI45_SOURCE_MUX         default: PCLK2
#if defined(RCC_D2CCIP1R_SPI45SEL)
  #define CFG_SPI45_PLCK2                       0
  #define CFG_SPI45_PLL2Q                       RCC_D2CCIP1R_SPI45SEL_0
  #define CFG_SPI45_PLL3Q                       RCC_D2CCIP1R_SPI45SEL_1
  #define CFG_SPI45_HSI                         (RCC_D2CCIP1R_SPI45SEL_1 | RCC_D2CCIP1R_SPI45SEL_0)
  #define CFG_SPI45_CSI                         RCC_D2CCIP1R_SPI45SEL_2
  #define CFG_SPI45_HSE                         (RCC_D2CCIP1R_SPI45SEL_2 | RCC_D2CCIP1R_SPI45SEL_0)
#else
  #define CFG_SPI45_PLCK2                       0
  #define CFG_SPI45_PLL2Q                       RCC_CDCCIP1R_SPI45SEL_0
  #define CFG_SPI45_PLL3Q                       RCC_CDCCIP1R_SPI45SEL_1
  #define CFG_SPI45_HSI                         (RCC_CDCCIP1R_SPI45SEL_1 | RCC_CDCCIP1R_SPI45SEL_0)
  #define CFG_SPI45_CSI                         RCC_CDCCIP1R_SPI45SEL_2
  #define CFG_SPI45_HSE                         (RCC_CDCCIP1R_SPI45SEL_2 | RCC_CDCCIP1R_SPI45SEL_0)
#endif

/// Multiplexer define to be used for SPI6 clock source                                                 -> CFG_SPI6_SOURCE_MUX          default: PCLK4
#if defined(RCC_D3CCIPR_SPI6SEL)
  #define CFG_SPI6_PLCK4                        0
  #define CFG_SPI6_PLL2Q                        RCC_D3CCIPR_SPI6SEL_0
  #define CFG_SPI6_PLL3Q                        RCC_D3CCIPR_SPI6SEL_1
  #define CFG_SPI6_HSI                          (RCC_D3CCIPR_SPI6SEL_1 | RCC_D3CCIPR_SPI6SEL_0)
  #define CFG_SPI6_CSI                          RCC_D3CCIPR_SPI6SEL_2
  #define CFG_SPI6_HSE                          (RCC_D3CCIPR_SPI6SEL_2 | RCC_D3CCIPR_SPI6SEL_0)
#else
  #define CFG_SPI6_PLCK4                        0
  #define CFG_SPI6_PLL2Q                        RCC_SRDCCIPR_SPI6SEL_0
  #define CFG_SPI6_PLL3Q                        RCC_SRDCCIPR_SPI6SEL_1
  #define CFG_SPI6_HSI                          (RCC_SRDCCIPR_SPI6SEL_1 | RCC_SRDCCIPR_SPI6SEL_0)
  #define CFG_SPI6_CSI                          RCC_SRDCCIPR_SPI6SEL_2
  #define CFG_SPI6_HSE                          (RCC_SRDCCIPR_SPI6SEL_2 | RCC_SRDCCIPR_SPI6SEL_0)
#endif

/// Multiplexer define to be used for SWP clock source                                                  -> CFG_SWP_SOURCE_MUX           default: PCLK1
#if defined(RCC_D2CCIP1R_SWPSEL)
  #define CFG_SWP_PCLK1                         0
  #define CFG_SWP_HSI                           RCC_D2CCIP1R_SWPSEL
#else
  #define CFG_SWP_PCLK1                         0
  #define CFG_SWP_HSI                           RCC_CDCCIP1R_SWPSEL
#endif

#if defined(RCC_D2CCIP2R_USART16SEL)
  /// Multiplexer define to be used for UART1, UART6 clock source                                       -> CFG_UART16_SOURCE_MUX        default: PCLK2
  #define CFG_USART16_PCLK2                     0
  #define CFG_USART16_PLL2Q                     RCC_D2CCIP2R_USART16SEL_0
  #define CFG_USART16_PLL3Q                     RCC_D2CCIP2R_USART16SEL_1
  #define CFG_USART16_HSI                       (RCC_D2CCIP2R_USART16SEL_1 | RCC_D2CCIP2R_USART16SEL_0)
  #define CFG_USART16_CSI                       RCC_D2CCIP2R_USART16SEL_2
  #define CFG_USART16_LSE                       (RCC_D2CCIP2R_USART16SEL_2 | RCC_D2CCIP2R_USART16SEL_0)
#elif defined(RCC_CDCCIP2R_USART16910SEL)
  /// Multiplexer define to be used for UART1, UART6, UART9, UART10 clock source                        -> CFG_UART16910_SOURCE_MUX     default: PCLK2
  #define CFG_USART16910_PCLK2                  0
  #define CFG_USART16910_PLL2Q                  RCC_CDCCIP2R_USART16910SEL_0
  #define CFG_USART16910_PLL3Q                  RCC_CDCCIP2R_USART16910SEL_1
  #define CFG_USART16910_HSI                    (RCC_CDCCIP2R_USART16910SEL_1 | RCC_CDCCIP2R_USART16910SEL_0)
  #define CFG_USART16910_CSI                    RCC_CDCCIP2R_USART16910SEL_2
  #define CFG_USART16910_LSE                    (RCC_CDCCIP2R_USART16910SEL_2 | RCC_CDCCIP2R_USART16910SEL_0)
#else // #if defined(RCC_D2CCIP2R_USART16910SEL)
  /// Multiplexer define to be used for UART1, UART6, UART9, UART10 clock source                        -> CFG_UART16910_SOURCE_MUX     default: PCLK2
  #define CFG_USART16910_PCLK2                  0
  #define CFG_USART16910_PLL2Q                  RCC_D2CCIP2R_USART16910SEL_0
  #define CFG_USART16910_PLL3Q                  RCC_D2CCIP2R_USART16910SEL_1
  #define CFG_USART16910_HSI                    (RCC_D2CCIP2R_USART16910SEL_1 | RCC_D2CCIP2R_USART16910SEL_0)
  #define CFG_USART16910_CSI                    RCC_D2CCIP2R_USART16910SEL_2
  #define CFG_USART16910_LSE                    (RCC_D2CCIP2R_USART16910SEL_2 | RCC_D2CCIP2R_USART16910SEL_0)
#endif

#if defined(RCC_D2CCIP2R_USART28SEL)
  /// Multiplexer define to be used for UART2, UART3, UART4, UART5, UART7 and UART8 clock source        -> CFG_UART234578_SOURCE_MUX    default: PCLK1
  #define CFG_USART234578_PCLK1                 0
  #define CFG_USART234578_PLL2Q                 RCC_D2CCIP2R_USART28SEL_0
  #define CFG_USART234578_PLL3Q                 RCC_D2CCIP2R_USART28SEL_1
  #define CFG_USART234578_HSI                   (RCC_D2CCIP2R_USART28SEL_1 | RCC_D2CCIP2R_USART28SEL_0)
  #define CFG_USART234578_CSI                   RCC_D2CCIP2R_USART28SEL_2
  #define CFG_USART234578_LSE                   (RCC_D2CCIP2R_USART28SEL_2 | RCC_D2CCIP2R_USART28SEL_0)
#else
  /// Multiplexer define to be used for UART2, UART3, UART4, UART5, UART7 and UART8 clock source        -> CFG_UART234578_SOURCE_MUX    default: PCLK1
  #define CFG_USART234578_PCLK1                 0
  #define CFG_USART234578_PLL2Q                 RCC_CDCCIP2R_USART234578SEL_0
  #define CFG_USART234578_PLL3Q                 RCC_CDCCIP2R_USART234578SEL_1
  #define CFG_USART234578_HSI                   (RCC_CDCCIP2R_USART234578SEL_1 | RCC_CDCCIP2R_USART234578SEL_0)
  #define CFG_USART234578_CSI                   RCC_CDCCIP2R_USART234578SEL_2
  #define CFG_USART234578_LSE                   (RCC_CDCCIP2R_USART234578SEL_2 | RCC_CDCCIP2R_USART234578SEL_0)
#endif

/// Multiplexer define to be used for USB clock source                                                  -> CFG_USB_SOURCE_MUX           default: PLL1Q
#if defined(RCC_D2CCIP2R_USBSEL)
  #define CFG_USB_PLL1Q                         0
  #define CFG_USB_PLL3Q                         RCC_D2CCIP2R_USBSEL_0
  #define CFG_USB_HSI48                         RCC_D2CCIP2R_USBSEL_1
#else
  #define CFG_USB_PLL1Q                         0
  #define CFG_USB_PLL3Q                         RCC_CDCCIP2R_USBSEL_0
  #define CFG_USB_HSI48                         RCC_CDCCIP2R_USBSEL_1
#endif

// Divider for all Clock

