aroyer-qc/Digini/Peripheral/inc/port/STM32H7xx/lib_STM32H7_system_clock.h
#if defined(RCC_D1CFGR_D1CPRE_DIV1)
  #define CFG_SYSCLK_DIV1                       RCC_D1CFGR_D1CPRE_DIV1
  #define CFG_SYSCLK_DIV2                       RCC_D1CFGR_D1CPRE_DIV2
  #define CFG_SYSCLK_DIV4                       RCC_D1CFGR_D1CPRE_DIV4
  #define CFG_SYSCLK_DIV8                       RCC_D1CFGR_D1CPRE_DIV8
  #define CFG_SYSCLK_DIV16                      RCC_D1CFGR_D1CPRE_DIV16
  #define CFG_SYSCLK_DIV64                      RCC_D1CFGR_D1CPRE_DIV64
  #define CFG_SYSCLK_DIV128                     RCC_D1CFGR_D1CPRE_DIV128
  #define CFG_SYSCLK_DIV256                     RCC_D1CFGR_D1CPRE_DIV256
  #define CFG_SYSCLK_DIV512                     RCC_D1CFGR_D1CPRE_DIV512
#else
  #define CFG_SYSCLK_DIV1                       RCC_CDCFGR1_CDCPRE_DIV1
  #define CFG_SYSCLK_DIV2                       RCC_CDCFGR1_CDCPRE_DIV2
  #define CFG_SYSCLK_DIV4                       RCC_CDCFGR1_CDCPRE_DIV4
  #define CFG_SYSCLK_DIV8                       RCC_CDCFGR1_CDCPRE_DIV8
  #define CFG_SYSCLK_DIV16                      RCC_CDCFGR1_CDCPRE_DIV16
  #define CFG_SYSCLK_DIV64                      RCC_CDCFGR1_CDCPRE_DIV64
  #define CFG_SYSCLK_DIV128                     RCC_CDCFGR1_CDCPRE_DIV128
  #define CFG_SYSCLK_DIV256                     RCC_CDCFGR1_CDCPRE_DIV256
  #define CFG_SYSCLK_DIV512                     RCC_CDCFGR1_CDCPRE_DIV512
#endif

#if defined(RCC_D1CFGR_HPRE_DIV1)
  #define CFG_HCLK_DIV1                         RCC_D1CFGR_HPRE_DIV1
  #define CFG_HCLK_DIV2                         RCC_D1CFGR_HPRE_DIV2
  #define CFG_HCLK_DIV4                         RCC_D1CFGR_HPRE_DIV4
  #define CFG_HCLK_DIV8                         RCC_D1CFGR_HPRE_DIV8
  #define CFG_HCLK_DIV16                        RCC_D1CFGR_HPRE_DIV16
  #define CFG_HCLK_DIV64                        RCC_D1CFGR_HPRE_DIV64
  #define CFG_HCLK_DIV128                       RCC_D1CFGR_HPRE_DIV128
  #define CFG_HCLK_DIV256                       RCC_D1CFGR_HPRE_DIV256
  #define CFG_HCLK_DIV512                       RCC_D1CFGR_HPRE_DIV512
#else
  #define CFG_HCLK_DIV1                         RCC_CDCFGR1_HPRE_DIV1
  #define CFG_HCLK_DIV2                         RCC_CDCFGR1_HPRE_DIV2
  #define CFG_HCLK_DIV4                         RCC_CDCFGR1_HPRE_DIV4
  #define CFG_HCLK_DIV8                         RCC_CDCFGR1_HPRE_DIV8
  #define CFG_HCLK_DIV16                        RCC_CDCFGR1_HPRE_DIV16
  #define CFG_HCLK_DIV64                        RCC_CDCFGR1_HPRE_DIV64
  #define CFG_HCLK_DIV128                       RCC_CDCFGR1_HPRE_DIV128
  #define CFG_HCLK_DIV256                       RCC_CDCFGR1_HPRE_DIV256
  #define CFG_HCLK_DIV512                       RCC_CDCFGR1_HPRE_DIV512
#endif

#if defined (RCC_D2CFGR_D2PPRE1_DIV1)
  #define CFG_APB1_DIV1                         RCC_D2CFGR_D2PPRE1_DIV1
  #define CFG_APB1_DIV2                         RCC_D2CFGR_D2PPRE1_DIV2
  #define CFG_APB1_DIV4                         RCC_D2CFGR_D2PPRE1_DIV4
  #define CFG_APB1_DIV8                         RCC_D2CFGR_D2PPRE1_DIV8
  #define CFG_APB1_DIV16                        RCC_D2CFGR_D2PPRE1_DIV16
#else
  #define CFG_APB1_DIV1                         RCC_CDCFGR2_CDPPRE1_DIV1
  #define CFG_APB1_DIV2                         RCC_CDCFGR2_CDPPRE1_DIV2
  #define CFG_APB1_DIV4                         RCC_CDCFGR2_CDPPRE1_DIV4
  #define CFG_APB1_DIV8                         RCC_CDCFGR2_CDPPRE1_DIV8
  #define CFG_APB1_DIV16                        RCC_CDCFGR2_CDPPRE1_DIV16
#endif

#if defined (RCC_D2CFGR_D2PPRE2_DIV1)
  #define CFG_APB2_DIV1                         RCC_D2CFGR_D2PPRE2_DIV1
  #define CFG_APB2_DIV2                         RCC_D2CFGR_D2PPRE2_DIV2
  #define CFG_APB2_DIV4                         RCC_D2CFGR_D2PPRE2_DIV4
  #define CFG_APB2_DIV8                         RCC_D2CFGR_D2PPRE2_DIV8
  #define CFG_APB2_DIV16                        RCC_D2CFGR_D2PPRE2_DIV16
#else
  #define CFG_APB2_DIV1                         RCC_CDCFGR2_CDPPRE2_DIV1
  #define CFG_APB2_DIV2                         RCC_CDCFGR2_CDPPRE2_DIV2
  #define CFG_APB2_DIV4                         RCC_CDCFGR2_CDPPRE2_DIV4
  #define CFG_APB2_DIV8                         RCC_CDCFGR2_CDPPRE2_DIV8
  #define CFG_APB2_DIV16                        RCC_CDCFGR2_CDPPRE2_DIV16
#endif

#if defined (RCC_D1CFGR_D1PPRE_DIV1)
  #define CFG_APB3_DIV1                         RCC_D1CFGR_D1PPRE_DIV1
  #define CFG_APB3_DIV2                         RCC_D1CFGR_D1PPRE_DIV2
  #define CFG_APB3_DIV4                         RCC_D1CFGR_D1PPRE_DIV4
  #define CFG_APB3_DIV8                         RCC_D1CFGR_D1PPRE_DIV8
  #define CFG_APB3_DIV16                        RCC_D1CFGR_D1PPRE_DIV16
#else
  #define CFG_APB3_DIV1                         RCC_CDCFGR1_CDPPRE_DIV1
  #define CFG_APB3_DIV2                         RCC_CDCFGR1_CDPPRE_DIV2
  #define CFG_APB3_DIV4                         RCC_CDCFGR1_CDPPRE_DIV4
  #define CFG_APB3_DIV8                         RCC_CDCFGR1_CDPPRE_DIV8
  #define CFG_APB3_DIV16                        RCC_CDCFGR1_CDPPRE_DIV16
#endif

#if defined(RCC_D3CFGR_D3PPRE_DIV1)
  #define CFG_APB4_DIV1                         RCC_D3CFGR_D3PPRE_DIV1
  #define CFG_APB4_DIV2                         RCC_D3CFGR_D3PPRE_DIV2
  #define CFG_APB4_DIV4                         RCC_D3CFGR_D3PPRE_DIV4
  #define CFG_APB4_DIV8                         RCC_D3CFGR_D3PPRE_DIV8
  #define CFG_APB4_DIV16                        RCC_D3CFGR_D3PPRE_DIV16
#else
  #define CFG_APB4_DIV1                         RCC_SRDCFGR_SRDPPRE_DIV1
  #define CFG_APB4_DIV2                         RCC_SRDCFGR_SRDPPRE_DIV2
  #define CFG_APB4_DIV4                         RCC_SRDCFGR_SRDPPRE_DIV4
  #define CFG_APB4_DIV8                         RCC_SRDCFGR_SRDPPRE_DIV8
  #define CFG_APB4_DIV16                        RCC_SRDCFGR_SRDPPRE_DIV16
#endif

// Valid for PLL1, PLL2, PLL3
#define CFG_RCC_PLLDIVR_PLL_N_POS               0
#define CFG_RCC_PLLDIVR_PLL_P_POS               9
#define CFG_RCC_PLLDIVR_PLL_Q_POS               16
#define CFG_RCC_PLLDIVR_PLL_R_POS               24

// PLL Clock Source and POS
#define CFG_RCC_PLLCKSELR_PLLSRC_HSI            0x00000000
#define CFG_RCC_PLLCKSELR_PLLSRC_CSI            0x00000001
#define CFG_RCC_PLLCKSELR_PLLSRC_HSE            0x00000002
#define CFG_RCC_PLLCKSELR_PLLSRC_POS            0
#define CFG_RCC_PLLCKSELR_PLL1_DIV_M_POS        4
#define CFG_RCC_PLLCKSELR_PLL2_DIV_M_POS        12
#define CFG_RCC_PLLCKSELR_PLL3_DIV_M_POS        20

// Enable for PLL output bit pos
#define RCC_PLLCFGR_PLL1P_POS                   16
#define RCC_PLLCFGR_PLL1Q_POS                   17
#define RCC_PLLCFGR_PLL1R_POS                   18
#define RCC_PLLCFGR_PLL2P_POS                   19
#define RCC_PLLCFGR_PLL2Q_POS                   20
#define RCC_PLLCFGR_PLL2R_POS                   21
#define RCC_PLLCFGR_PLL3P_POS                   22
#define RCC_PLLCFGR_PLL3Q_POS                   23
#define RCC_PLLCFGR_PLL3R_POS                   24

// Power regulator
#if defined(PWR_D3CR_VOS)
  #define CFG_PWR_REGULATOR_VOLTAGE_SCALE0      (0)
  #define CFG_PWR_REGULATOR_VOLTAGE_SCALE1      (PWR_D3CR_VOS_1 | PWR_D3CR_VOS_0)
  #define CFG_PWR_REGULATOR_VOLTAGE_SCALE2      (PWR_D3CR_VOS_1)
  #define CFG_PWR_REGULATOR_VOLTAGE_SCALE3      (PWR_D3CR_VOS_0)
#endif

//-------------------------------------------------------------------------------------------------
// Configuration file(s)
//-------------------------------------------------------------------------------------------------

