aroyer-qc/Digini/Peripheral/inc/port/STM32H7xx/lib_STM32H7_system_clock.h
#include "clock_cfg.h"

//-------------------------------------------------------------------------------------------------
// Auto define configuration
//-------------------------------------------------------------------------------------------------

#define HSI_CLOCK_FREQUENCY                         (HSI_RC_CLOCK_FREQUENCY / CFG_HSI_DIVIDER)


/// --------------------------------------------------------------------------------------------------------------------------------
/// Autoconfig value for PLL

#if (CFG_SYS_CLOCK_MUX == CFG_RCC_CFGR_SW_PLL1)

  #define SYS_PLL_CLK_FREQUENCY                     (((CFG_FREQ_PLL_SOURCE / CFG_PLL1_M_DIVIDER) * CFG_PLL1_N_MULTIPLIER) / CFG_PLL1_P_DIVIDER)

#endif // CFG_SYS_CLOCK_MUX == CFG_RCC_CFGR_SW_PLL1

/// -------------------------------------------------------------------------------------------------------------------------------
/// PLL1 Configuration
///
/// need to account example: 2 =  1 in selection for all divider!!!!

#if (CFG_PLL1_M_DIVIDER < MIN_DIVM1) || (CFG_PLL1_M_DIVIDER > MAX_DIVM1)
  #pragma message XSTR(CFG_PLL1_M_DIVIDER)
  #error PLL1M is out of range
#else
  #define CFG_RCC_PLLCKSELR_PLL1_M                  (CFG_PLL1_M_DIVIDER << CFG_RCC_PLLCKSELR_PLL1_DIV_M_POS)
#endif

#if (CFG_PLL1_N_MULTIPLIER < MIN_MULN1) || (CFG_PLL1_N_MULTIPLIER > MAX_MULN1)
  #pragma message "XSTR(CFG_PLL1_N_MULTIPLIER)"
  #error PLL1N is out of range
#else
  #define CFG_RCC_PLLDIVR_PLL1_N                    (CFG_PLL1_N_MULTIPLIER << CFG_RCC_PLLDIVR_PLL_N_POS)
#endif

#if (CFG_PLL1_P_DIVIDER < MIN_DIVP1) || (CFG_PLL1_P_DIVIDER > MAX_DIVP1)
  #pragma message "XSTR(CFG_PLL1_P_DIVIDER)"
  #error PLL1P is out of range
#else
  #define CFG_RCC_PLLDIVR_PLL1_P                    (CFG_PLL1_P_DIVIDER << CFG_RCC_PLLDIVR_PLL_P_POS)
#endif

#if (CFG_PLL1_Q_DIVIDER < MIN_DIVQ1) || (CFG_PLL1_Q_DIVIDER > MAX_DIVQ1)
  #pragma message "XSTR(CFG_PLL1_Q_DIVIDER)"
  #error PLL1Q is out of range
#else
  #define CFG_RCC_PLLDIVR_PLL1_Q                    (CFG_PLL1_Q_DIVIDER << CFG_RCC_PLLDIVR_PLL_Q_POS)
#endif

#if (CFG_PLL1_R_DIVIDER < MIN_DIVR1) || (CFG_PLL1_R_DIVIDER > MAX_DIVR1)
  #pragma message "XSTR(CFG_PLL1_R_DIVIDER)"
  #error PLL1R is out of range
#else
  #define CFG_RCC_PLLDIVR_PLL1_R                    (CFG_PLL1_R_DIVIDER << CFG_RCC_PLLDIVR_PLL_R_POS)
#endif

#define CFG_RCC_PLL1_DIVR                           (CFG_RCC_PLLDIVR_PLL1_N |   \
                                                     CFG_RCC_PLLDIVR_PLL1_P |   \
                                                     CFG_RCC_PLLDIVR_PLL1_Q |   \
                                                     CFG_RCC_PLLDIVR_PLL1_R)

#define PLL1_CLOCK_FREQUENCY                        ((CFG_FREQ_PLL_SOURCE / CFG_PLL1_M_DIVIDER) * CFG_PLL1_N_MULTIPLIER)
#define PLL1P_CLOCK_FREQUENCY                       (PLL1_CLOCK_FREQUENCY / CFG_PLL1_P_DIVIDER)
#define PLL1Q_CLOCK_FREQUENCY                       (PLL1_CLOCK_FREQUENCY / CFG_PLL1_Q_DIVIDER)
#define PLL1R_CLOCK_FREQUENCY                       (PLL1_CLOCK_FREQUENCY / CFG_PLL1_R_DIVIDER)

/// -------------------------------------------------------------------------------------------------------------------------------
/// PLL2 Configuration
///

#if (CFG_PLL2_M_DIVIDER < MIN_DIVM2) || (CFG_PLL2_M_DIVIDER > MAX_DIVM2)
  #pragma message XSTR(CFG_PLL2_M_DIVIDER)
  #error PLL2M is out of range
#else
  #define CFG_RCC_PLLCKSELR_PLL2_M                  (CFG_PLL2_M_DIVIDER << CFG_RCC_PLLCKSELR_PLL2_DIV_M_POS)
#endif

#if (CFG_PLL2_N_MULTIPLIER < MIN_MULN2) || (CFG_PLL2_N_MULTIPLIER > MAX_MULN2)
  #pragma message "XSTR(CFG_PLL2_N_MULTIPLIER)"
  #error PLL2N is out of range
#else
  #define CFG_RCC_PLLDIVR_PLL2_N                    (CFG_PLL2_N_MULTIPLIER << CFG_RCC_PLLDIVR_PLL_N_POS)
#endif

#if (CFG_PLL2_P_DIVIDER < MIN_DIVP2) || (CFG_PLL2_P_DIVIDER > MAX_DIVP2)
  #pragma message "XSTR(CFG_PLL2_P_DIVIDER)"
  #error PLL2P is out of range
#else
  #define CFG_RCC_PLLDIVR_PLL2_P                    (CFG_PLL2_P_DIVIDER << CFG_RCC_PLLDIVR_PLL_P_POS)
#endif

#if (CFG_PLL2_Q_DIVIDER < MIN_DIVQ2) || (CFG_PLL2_Q_DIVIDER > MAX_DIVQ2)
  #pragma message "XSTR(CFG_PLL2_Q_DIVIDER)"
  #error PLL2Q is out of range
#else
  #define CFG_RCC_PLLDIVR_PLL2_Q                    (CFG_PLL2_Q_DIVIDER << CFG_RCC_PLLDIVR_PLL_Q_POS)
#endif

#if (CFG_PLL2_R_DIVIDER < MIN_DIVR2) || (CFG_PLL2_R_DIVIDER > MAX_DIVR2)
  #pragma message "XSTR(CFG_PLL2_R_DIVIDER)"
  #error PLL2R is out of range
#else
  #define CFG_RCC_PLLDIVR_PLL2_R                    (CFG_PLL2_R_DIVIDER << CFG_RCC_PLLDIVR_PLL_R_POS)
#endif

#define CFG_RCC_PLL2_DIVR                           (CFG_RCC_PLLDIVR_PLL2_N |   \
                                                     CFG_RCC_PLLDIVR_PLL2_P |   \
                                                     CFG_RCC_PLLDIVR_PLL2_Q |   \
                                                     CFG_RCC_PLLDIVR_PLL2_R)

#define PLL2_CLOCK_FREQUENCY                        ((CFG_FREQ_PLL_SOURCE / CFG_PLL2_M_DIVIDER) * CFG_PLL2_N_MULTIPLIER)
#define PLL2P_CLOCK_FREQUENCY                       (PLL2_CLOCK_FREQUENCY / CFG_PLL2_P_DIVIDER)
#define PLL2Q_CLOCK_FREQUENCY                       (PLL2_CLOCK_FREQUENCY / CFG_PLL2_Q_DIVIDER)
#define PLL2R_CLOCK_FREQUENCY                       (PLL2_CLOCK_FREQUENCY / CFG_PLL2_R_DIVIDER)

/// -------------------------------------------------------------------------------------------------------------------------------
/// PLL3 Configuration
///

#if (CFG_PLL3_M_DIVIDER < MIN_DIVM3) || (CFG_PLL3_M_DIVIDER > MAX_DIVM3)
  #pragma message XSTR(CFG_PLL3_M_DIVIDER)
  #error PLL3M is out of range
#else
  #define CFG_RCC_PLLCKSELR_PLL3_M                  (CFG_PLL3_M_DIVIDER << CFG_RCC_PLLCKSELR_PLL3_DIV_M_POS)
#endif

#if (CFG_PLL3_N_MULTIPLIER < MIN_MULN3) || (CFG_PLL3_N_MULTIPLIER > MAX_MULN3)
  #pragma message "XSTR(CFG_PLL3_N_MULTIPLIER)"
  #error PLL3N is out of range
#else
  #define CFG_RCC_PLLDIVR_PLL3_N                    (CFG_PLL3_N_MULTIPLIER << CFG_RCC_PLLDIVR_PLL_N_POS)
#endif

#if (CFG_PLL3_P_DIVIDER < MIN_DIVP3) || (CFG_PLL3_P_DIVIDER > MAX_DIVP3)
  #pragma message "XSTR(CFG_PLL3_P_DIVIDER)"
  #error PLL3P is out of range
#else
  #define CFG_RCC_PLLDIVR_PLL3_P                    (CFG_PLL3_P_DIVIDER << CFG_RCC_PLLDIVR_PLL_P_POS)
#endif

