aroyer-qc/Digini/Peripheral/inc/port/STM32H7xx/lib_STM32H7_system_clock.h
#if (CFG_PLL3_Q_DIVIDER < MIN_DIVQ3) || (CFG_PLL3_Q_DIVIDER > MAX_DIVQ3)
  #pragma message "XSTR(CFG_PLL3_Q_DIVIDER)"
  #error PLL3Q is out of range
#else
  #define CFG_RCC_PLLDIVR_PLL3_Q                    (CFG_PLL3_Q_DIVIDER << CFG_RCC_PLLDIVR_PLL_Q_POS)
#endif

#if (CFG_PLL3_R_DIVIDER < MIN_DIVR3) || (CFG_PLL3_R_DIVIDER > MAX_DIVR3)
  #pragma message "XSTR(CFG_PLL3_R_DIVIDER)"
  #error PLL3R is out of range
#else
  #define CFG_RCC_PLLDIVR_PLL3_R                    (CFG_PLL3_R_DIVIDER << CFG_RCC_PLLDIVR_PLL_R_POS)
#endif

#define CFG_RCC_PLL3_DIVR                           (CFG_RCC_PLLDIVR_PLL3_N |   \
                                                     CFG_RCC_PLLDIVR_PLL3_P |   \
                                                     CFG_RCC_PLLDIVR_PLL3_Q |   \
                                                     CFG_RCC_PLLDIVR_PLL3_R)

#define PLL3_CLOCK_FREQUENCY                        ((CFG_FREQ_PLL_SOURCE / CFG_PLL3_M_DIVIDER) * CFG_PLL3_N_MULTIPLIER)
#define PLL3P_CLOCK_FREQUENCY                       (PLL3_CLOCK_FREQUENCY / CFG_PLL3_P_DIVIDER)
#define PLL3Q_CLOCK_FREQUENCY                       (PLL3_CLOCK_FREQUENCY / CFG_PLL3_Q_DIVIDER)
#define PLL3R_CLOCK_FREQUENCY                       (PLL3_CLOCK_FREQUENCY / CFG_PLL3_R_DIVIDER)

/// -------------------------------------------------------------------------------------------------------------------------------
/// PLLCKSELR
///

#define CFG_RCC_PLLCKSELR                           (CFG_RCC_PLLCKSELR_PLL1_M | \
                                                     CFG_RCC_PLLCKSELR_PLL2_M | \
                                                     CFG_RCC_PLLCKSELR_PLL3_M | \
                                                     CFG_MUX_PLL_SOURCE )

/// -------------------------------------------------------------------------------------------------------------------------------
/// PLLCFGR
///

#define CFG_PLLCFGR_OUTPUT_ENABLE                   ((CFG_ENABLE_PLL1P << RCC_PLLCFGR_PLL1P_POS) | \
                                                     (CFG_ENABLE_PLL1Q << RCC_PLLCFGR_PLL1Q_POS) | \
                                                     (CFG_ENABLE_PLL1R << RCC_PLLCFGR_PLL1R_POS) | \
                                                     (CFG_ENABLE_PLL2P << RCC_PLLCFGR_PLL2P_POS) | \
                                                     (CFG_ENABLE_PLL2Q << RCC_PLLCFGR_PLL2Q_POS) | \
                                                     (CFG_ENABLE_PLL2R << RCC_PLLCFGR_PLL2R_POS) | \
                                                     (CFG_ENABLE_PLL3P << RCC_PLLCFGR_PLL3P_POS) | \
                                                     (CFG_ENABLE_PLL3Q << RCC_PLLCFGR_PLL3Q_POS) | \
                                                     (CFG_ENABLE_PLL3R << RCC_PLLCFGR_PLL3R_POS))


#define PLL1_INPUT_CLOCK_FREQUENCY                  (CFG_FREQ_PLL_SOURCE / CFG_PLL1_M_DIVIDER)
#define PLL2_INPUT_CLOCK_FREQUENCY                  (CFG_FREQ_PLL_SOURCE / CFG_PLL2_M_DIVIDER)
#define PLL3_INPUT_CLOCK_FREQUENCY                  (CFG_FREQ_PLL_SOURCE / CFG_PLL3_M_DIVIDER)

#if (PLL1_INPUT_CLOCK_FREQUENCY < VCOSEL_FREQUENCY)
  #define CFG_PLLCFGR_PLL1VCOSEL                    RCC_PLLCFGR_PLL1VCOSEL
#else
  #define CFG_PLLCFGR_PLL1VCOSEL                    0
#endif

#if (PLL2_INPUT_CLOCK_FREQUENCY < VCOSEL_FREQUENCY)
  #define CFG_PLLCFGR_PLL2VCOSEL                    RCC_PLLCFGR_PLL2VCOSEL
#else
  #define CFG_PLLCFGR_PLL2VCOSEL                    0
#endif

#if (PLL3_INPUT_CLOCK_FREQUENCY < VCOSEL_FREQUENCY)
  #define CFG_PLLCFGR_PLL3VCOSEL                    RCC_PLLCFGR_PLL3VCOSEL
#else
  #define CFG_PLLCFGR_PLL3VCOSEL                    0
#endif

#if   (PLL1_INPUT_CLOCK_FREQUENCY >= 1000000) && (PLL1_INPUT_CLOCK_FREQUENCY <= 2000000)
  #define CFG_PLLCFGR_PLL1RGE                       RCC_PLLCFGR_PLL1RGE_0
#elif (PLL1_INPUT_CLOCK_FREQUENCY >  2000000) && (PLL1_INPUT_CLOCK_FREQUENCY <= 4000000)
  #define CFG_PLLCFGR_PLL1RGE                       RCC_PLLCFGR_PLL1RGE_1
#elif (PLL1_INPUT_CLOCK_FREQUENCY >  4000000) && (PLL1_INPUT_CLOCK_FREQUENCY <= 8000000)
  #define CFG_PLLCFGR_PLL1RGE                       RCC_PLLCFGR_PLL1RGE_2
#elif (PLL1_INPUT_CLOCK_FREQUENCY >  8000000) && (PLL1_INPUT_CLOCK_FREQUENCY <= 1600000)
  #define CFG_PLLCFGR_PLL1RGE                       RCC_PLLCFGR_PLL1RGE_3
#else
 #error PLL1 input frequency outside of allowed range!
#endif

#if   (PLL2_INPUT_CLOCK_FREQUENCY >= 1000000) && (PLL2_INPUT_CLOCK_FREQUENCY <= 2000000)
  #define CFG_PLLCFGR_PLL2RGE                       RCC_PLLCFGR_PLL2RGE_0
#elif (PLL2_INPUT_CLOCK_FREQUENCY >  2000000) && (PLL2_INPUT_CLOCK_FREQUENCY <= 4000000)
  #define CFG_PLLCFGR_PLL2RGE                       RCC_PLLCFGR_PLL2RGE_1
#elif (PLL2_INPUT_CLOCK_FREQUENCY >  4000000) && (PLL2_INPUT_CLOCK_FREQUENCY <= 8000000)
  #define CFG_PLLCFGR_PLL2RGE                       RCC_PLLCFGR_PLL2RGE_2
#elif (PLL2_INPUT_CLOCK_FREQUENCY >  8000000) && (PLL2_INPUT_CLOCK_FREQUENCY <= 16000000)
  #define CFG_PLLCFGR_PLL2RGE                       RCC_PLLCFGR_PLL2RGE_3
#else
 #error PLL2 input frequency outside of allowed range!
#endif

#if   (PLL3_INPUT_CLOCK_FREQUENCY >= 1000000) && (PLL3_INPUT_CLOCK_FREQUENCY <= 2000000)
  #define CFG_PLLCFGR_PLL3RGE                       RCC_PLLCFGR_PLL3RGE_0
#elif (PLL3_INPUT_CLOCK_FREQUENCY >  2000000) && (PLL3_INPUT_CLOCK_FREQUENCY <= 4000000)
  #define CFG_PLLCFGR_PLL3RGE                       RCC_PLLCFGR_PLL3RGE_1
#elif (PLL3_INPUT_CLOCK_FREQUENCY >  4000000) && (PLL3_INPUT_CLOCK_FREQUENCY <= 8000000)
  #define CFG_PLLCFGR_PLL3RGE                       RCC_PLLCFGR_PLL3RGE_2
#elif (PLL3_INPUT_CLOCK_FREQUENCY >  8000000) && (PLL3_INPUT_CLOCK_FREQUENCY <= 16000000)
  #define CFG_PLLCFGR_PLL3RGE                       RCC_PLLCFGR_PLL3RGE_3
#else
 #error PLL3 input frequency outside of allowed range!
#endif

#if (CFG_PLL1_FRACTIONAL_VALUE == 0)
  #define CFG_PLLCFGR_PLL1FRAEN                     0
#else
  #define CFG_PLLCFGR_PLL1FRAEN                     RCC_PLLCFGR_PLL1FRAEN
#endif

#if (CFG_PLL2_FRACTIONAL_VALUE == 0)
  #define CFG_PLLCFGR_PLL2FRAEN                     0
#else
  #define CFG_PLLCFGR_PLL2FRAEN                     RCC_PLLCFGR_PLL2FRAEN
#endif

