aroyer-qc/Digini/Peripheral/inc/port/STM32H7xx/lib_STM32H7_system_clock.h
#if (CFG_PLL3_FRACTIONAL_VALUE == 0)
  #define CFG_PLLCFGR_PLL3FRAEN                     0
#else
  #define CFG_PLLCFGR_PLL3FRAEN                     RCC_PLLCFGR_PLL3FRAEN
#endif

#define CFG_RCC_PLLCFGR                             (CFG_PLLCFGR_OUTPUT_ENABLE  | \
                                                     CFG_PLLCFGR_PLL1VCOSEL     | \
                                                     CFG_PLLCFGR_PLL2VCOSEL     | \
                                                     CFG_PLLCFGR_PLL3VCOSEL     | \
                                                     CFG_PLLCFGR_PLL1RGE        | \
                                                     CFG_PLLCFGR_PLL2RGE        | \
                                                     CFG_PLLCFGR_PLL3RGE        | \
                                                     CFG_PLLCFGR_PLL1FRAEN      | \
                                                     CFG_PLLCFGR_PLL2FRAEN      | \
                                                     CFG_PLLCFGR_PLL3FRAEN)

/// -------------------------------------------------------------------------------------------------------------------------------
/// RCC_CFGR
///

/// Missing RTEPRE

#define CFG_RCC_CFGR                                (CFG_MCO1_SOURCE_MUX        | \
                                                     CFG_MCO2_SOURCE_MUX        | \
                                                     CFG_HRTIM_SOURCE_MUX)

/// -------------------------------------------------------------------------------------------------------------------------------
/// RCC domain kernel clock configuration register
///
/// RCC_D1CCIPR or RCC_CDCCIPR
///

// missing DSI

#if defined(QUADSPI)
  #define CFG_RCC_D1CCIPR_CPU_DEPENDANCY            CFG_QSPI_SOURCE_MUX
#endif

#if defined(OCTOSPI1) || defined(OCTOSPI2)
  #define CFG_RCC_D1CCIPR_CPU_DEPENDANCY            CFG_OSPI_SOURCE_MUX
#endif

#define CFG_RCC_D1CCIPR                             (CFG_PER_SOURCE_MUX         | \
                                                     CFG_SDMMC_SOURCE_MUX       | \
                                                     CFG_FMC_SOURCE_MUX         | \
                                                     CFG_RCC_D1CCIPR_CPU_DEPENDANCY)

#define CFG_RCC_CDCCIPR                             CFG_RCC_D1CCIPR                                 // Alias

/// -------------------------------------------------------------------------------------------------------------------------------
/// RCC domain kernel clock configuration register
///
/// RCC_D2CCIP1R or RCC_CDCCIP1R

#if defined(RCC_D2CCIP1R_SAI23SEL)
  #define CFG_RCC_D2CCIP1R_CPU_DEPENDANCY           CFG_SAI23_SOURCE_MUX
#elif defined(RCC_CDCCIP1R_SAI2ASEL) && defined(RCC_CDCCIP1R_SAI2BSEL)
  #define CFG_RCC_D2CCIP1R_CPU_DEPENDANCY           (CFG_SAI2A_SOURCE_MUX | CFG_SAI2A_SOURCE_MUX)
#else
  #define CFG_RCC_D2CCIP1R_CPU_DEPENDANCY           0
#endif

#define CFG_RCC_D2CCIP1R                            (CFG_SWP_SOURCE_MUX         | \
                                                     CFG_FDCAN_SOURCE_MUX       | \
                                                     CFG_DFSDM1_SOURCE_MUX      | \
                                                     CFG_SPDIF_SOURCE_MUX       | \
                                                     CFG_SPI123_SOURCE_MUX      | \
                                                     CFG_SPI45_SOURCE_MUX       | \
                                                     CFG_SAI1_SOURCE_MUX        | \
                                                     CFG_RCC_D2CCIP1R_CPU_DEPENDANCY)

#define CFG_RCC_CDCCIP1R                            CFG_RCC_D2CCIP1R                                // Alias

/// -------------------------------------------------------------------------------------------------------------------------------
/// RCC domain kernel clock configuration register
///
/// RCC_D2CCIP2R or RCC_CDCCIP2R

#if defined(RCC_D2CCIP2R_USART16SEL)
  #define CFG_RCC_D2CCIP2R_CPU_DEPENDANCY_1         CFG_UART16_SOURCE_MUX
#elif defined(RCC_D2CCIP2R_USART16910SEL) || defined(RCC_CDCCIP2R_USART16910SEL)
  #define CFG_RCC_D2CCIP2R_CPU_DEPENDANCY_1         CFG_UART16910_SOURCE_MUX
#endif

#if defined(RCC_D2CCIP2R_I2C123SEL) || defined(RCC_CDCCIP2R_I2C123SEL)
  #define CFG_RCC_D2CCIP2R_CPU_DEPENDANCY_2         CFG_I2C123_SOURCE_MUX
#elif defined(RCC_D2CCIP2R_I2C1235SEL)
  #define CFG_RCC_D2CCIP2R_CPU_DEPENDANCY_2         CFG_I2C1235_SOURCE_MUX
#endif

#define CFG_RCC_D2CCIP2R                            (CFG_LPTIM1_SOURCE_MUX              | \
                                                     CFG_CEC_SOURCE_MUX                 | \
                                                     CFG_USB_SOURCE_MUX                 | \
                                                     CFG_RNG_SOURCE_MUX                 | \
                                                     CFG_UART234578_SOURCE_MUX          | \
                                                     CFG_RCC_D2CCIP2R_CPU_DEPENDANCY_1  | \
                                                     CFG_RCC_D2CCIP2R_CPU_DEPENDANCY_2)

#define CFG_RCC_CDCCIP2R                            CFG_RCC_D2CCIP2R                                // Alias

/// -------------------------------------------------------------------------------------------------------------------------------
/// SmartRun domain kernel clock configuration register
///
/// RCC_D3CCIPR or RCC_SRDCCIPR

#if defined(RCC_D3CCIPR_SAI4ASEL) && defined(RCC_D3CCIPR_SAI4BSEL)
  #define CFG_RCC_D3CCIPR_CPU_DEPENDANCY            (CFG_SAI4A_SOURCE_MUX | CFG_SAI4B_SOURCE_MUX)
#else
  #define CFG_RCC_D3CCIPR_CPU_DEPENDANCY            0
#endif

#define CFG_RCC_D3CCIPR                             (CFG_SPI6_SOURCE_MUX        | \
                                                     CFG_ADC_SOURCE_MUX         | \
                                                     CFG_LPTIM345_SOURCE_MUX    | \
                                                     CFG_LPTIM2_SOURCE_MUX      | \
                                                     CFG_I2C4_SOURCE_MUX        | \
                                                     CFG_LPUART1_SOURCE_MUX     | \
                                                     CFG_RCC_D3CCIPR_CPU_DEPENDANCY)

