aroyer-qc/Digini/Peripheral/inc/port/STM32H7xx/lib_STM32H7_system_clock.h
#define CFG_RCC_SRDCCIPR                            CFG_RCC_D3CCIPR                                 // Alias

/// -------------------------------------------------------------------------------------------------------------------------------
/// RCC CPU domain clock configuration register 1
///
/// RCC_D1CFGR or RCC_CDCFGR1
/// -------------------------------------------------------------------------------------------------------------------------------

#define CFG_RCC_D1CFGR                              (CFG_SYSCLK_DIVIDER | \
                                                     CFG_APB3_DIVIDER   | \
                                                     CFG_HCLK_DIVIDER)

#define CFG_RCC_CDCFGR1                             CFG_RCC_D1CFGR

/// -------------------------------------------------------------------------------------------------------------------------------
/// RCC CPU domain clock configuration register 2
///
/// RCC_D2CFGR or RCC_CDCFGR2
/// -------------------------------------------------------------------------------------------------------------------------------

#define CFG_RCC_D2CFGR                              (CFG_APB2_DIVIDER  | \
                                                     CFG_APB1_DIVIDER)

#define CFG_RCC_CDCFGR2                             CFG_RCC_D2CFGR

/// -------------------------------------------------------------------------------------------------------------------------------
/// RCC CPU domain clock configuration register 3
///
/// RCC_D3CFGR or RCC_CDCFGR3

#define CFG_RCC_D3CFGR                              (CFG_APB4_DIVIDER)

#define CFG_RCC_SRDCFGR                             CFG_RCC_D3CFGR

/// -------------------------------------------------------------------------------------------------------------------------------
/// SYS Clock Mux
///

#if (CFG_SYS_CLOCK_MUX == CFG_RCC_CFGR_SW_PLL1)
  #define SYS_CPU_CORE_CLOCK_FREQUENCY              SYS_PLL_CLK_FREQUENCY
#elif (CFG_SYS_CLOCK_MUX == CFG_RCC_CFGR_SW_HSI)
  #define SYS_CPU_CORE_CLOCK_FREQUENCY              HSI_CLOCK_FREQUENCY
#elif (CFG_SYS_CLOCK_MUX == CFG_RCC_CFGR_SW_CSI)
  #define SYS_CPU_CORE_CLOCK_FREQUENCY              CFG_CSI_VALUE
#else //(CFG_SYS_CLOCK_MUX == CFG_RCC_CFGR_SW_HSE)
  #define SYS_CPU_CORE_CLOCK_FREQUENCY              CFG_HSE_VALUE
#endif


#if   CFG_SYSCLK_DIVIDER == CFG_SYSCLK_DIV1
  #define SYS_HCLK_CLOCK_FREQUENCY                  SYS_CPU_CORE_CLOCK_FREQUENCY
#elif CFG_SYSCLK_DIVIDER == CFG_SYSCLK_DIV2
  #define SYS_HCLK_CLOCK_FREQUENCY                  (SYS_CPU_CORE_CLOCK_FREQUENCY / 2)
#elif CFG_SYSCLK_DIVIDER == CFG_SYSCLK_DIV4
  #define SYS_HCLK_CLOCK_FREQUENCY                  (SYS_CPU_CORE_CLOCK_FREQUENCY / 4)
#elif CFG_SYSCLK_DIVIDER == CFG_SYSCLK_DIV8
  #define SYS_HCLK_CLOCK_FREQUENCY                  (SYS_CPU_CORE_CLOCK_FREQUENCY / 8)
#elif CFG_SYSCLK_DIVIDER == CFG_SYSCLK_DIV16
  #define SYS_HCLK_CLOCK_FREQUENCY                  (SYS_CPU_CORE_CLOCK_FREQUENCY / 16)
#elif CFG_SYSCLK_DIVIDER == CFG_SYSCLK_DIV64
  #define SYS_HCLK_CLOCK_FREQUENCY                  (SYS_CPU_CORE_CLOCK_FREQUENCY / 64)
#elif CFG_SYSCLK_DIVIDER == CFG_SYSCLK_DIV128
  #define SYS_HCLK_CLOCK_FREQUENCY                  (SYS_CPU_CORE_CLOCK_FREQUENCY / 128)
#elif CFG_SYSCLK_DIVIDER == CFG_SYSCLK_DIV256
  #define SYS_HCLK_CLOCK_FREQUENCY                  (SYS_CPU_CORE_CLOCK_FREQUENCY / 256)
#elif CFG_SYSCLK_DIVIDER == CFG_SYSCLK_DIV512
  #define SYS_HCLK_CLOCK_FREQUENCY                  (SYS_CPU_CORE_CLOCK_FREQUENCY / 512)
#endif


#if   CFG_HCLK_DIVIDER == CFG_HCLK_DIV1
    #define SYS_PERIPHERAL_MAIN_CLOCK_FREQUENCY     SYS_HCLK_CLOCK_FREQUENCY
#elif CFG_HCLK_DIVIDER == CFG_HCLK_DIV2
    #define SYS_PERIPHERAL_MAIN_CLOCK_FREQUENCY     (SYS_HCLK_CLOCK_FREQUENCY / 2)
#elif CFG_HCLK_DIVIDER == CFG_HCLK_DIV4
    #define SYS_PERIPHERAL_MAIN_CLOCK_FREQUENCY     (SYS_HCLK_CLOCK_FREQUENCY / 4)
#elif CFG_HCLK_DIVIDER == CFG_HCLK_DIV8
    #define SYS_PERIPHERAL_MAIN_CLOCK_FREQUENCY     (SYS_HCLK_CLOCK_FREQUENCY / 8)
#elif CFG_HCLK_DIVIDER == CFG_HCLK_DIV16
    #define SYS_PERIPHERAL_MAIN_CLOCK_FREQUENCY     (SYS_HCLK_CLOCK_FREQUENCY / 16)
#elif CFG_HCLK_DIVIDER == CFG_HCLK_DIV64
    #define SYS_PERIPHERAL_MAIN_CLOCK_FREQUENCY     (SYS_HCLK_CLOCK_FREQUENCY / 64)
#elif CFG_HCLK_DIVIDER == CFG_HCLK_DIV128
    #define SYS_PERIPHERAL_MAIN_CLOCK_FREQUENCY     (SYS_HCLK_CLOCK_FREQUENCY / 128)
#elif CFG_HCLK_DIVIDER == CFG_HCLK_DIV256
    #define SYS_PERIPHERAL_MAIN_CLOCK_FREQUENCY     (SYS_HCLK_CLOCK_FREQUENCY / 256)
#elif CFG_HCLK_DIVIDER == CFG_HCLK_DIV512
    #define SYS_PERIPHERAL_MAIN_CLOCK_FREQUENCY     (SYS_HCLK_CLOCK_FREQUENCY / 512)
#endif

#define AXI_CLOCK_FREQUENCY                         SYS_PERIPHERAL_MAIN_CLOCK_FREQUENCY
#define SYS_HCLK_CPU2_CLOCK_FREQUENCY               SYS_PERIPHERAL_MAIN_CLOCK_FREQUENCY             // If second core exist

#if   CFG_APB1_DIVIDER == CFG_APB1_DIV1
  #define PCLK1_CLOCK_FREQUENCY                     SYS_PERIPHERAL_MAIN_CLOCK_FREQUENCY
#elif CFG_APB1_DIVIDER == CFG_APB1_DIV2
  #define PCLK1_CLOCK_FREQUENCY                     (SYS_PERIPHERAL_MAIN_CLOCK_FREQUENCY / 2)
#elif CFG_APB1_DIVIDER == CFG_APB1_DIV4
  #define PCLK1_CLOCK_FREQUENCY                     (SYS_PERIPHERAL_MAIN_CLOCK_FREQUENCY / 4)
#elif CFG_APB1_DIVIDER == CFG_APB1_DIV8
  #define PCLK1_CLOCK_FREQUENCY                     (SYS_PERIPHERAL_MAIN_CLOCK_FREQUENCY / 8)
#elif CFG_APB1_DIVIDER == CFG_APB1_DIV16
  #define PCLK1_CLOCK_FREQUENCY                     (SYS_PERIPHERAL_MAIN_CLOCK_FREQUENCY / 16)
#endif

#if   CFG_APB2_DIVIDER == CFG_APB2_DIV1
  #define PCLK2_CLOCK_FREQUENCY                     SYS_PERIPHERAL_MAIN_CLOCK_FREQUENCY
#elif CFG_APB2_DIVIDER == CFG_APB2_DIV2
  #define PCLK2_CLOCK_FREQUENCY                     (SYS_PERIPHERAL_MAIN_CLOCK_FREQUENCY / 2)
#elif CFG_APB2_DIVIDER == CFG_APB2_DIV4
  #define PCLK2_CLOCK_FREQUENCY                     (SYS_PERIPHERAL_MAIN_CLOCK_FREQUENCY / 4)
#elif CFG_APB2_DIVIDER == CFG_APB2_DIV8
  #define PCLK2_CLOCK_FREQUENCY                     (SYS_PERIPHERAL_MAIN_CLOCK_FREQUENCY / 8)
#elif CFG_APB2_DIVIDER == CFG_APB2_DIV16
  #define PCLK2_CLOCK_FREQUENCY                     (SYS_PERIPHERAL_MAIN_CLOCK_FREQUENCY / 16)
#endif

#if   CFG_APB3_DIVIDER == CFG_APB3_DIV1
  #define PCLK3_CLOCK_FREQUENCY                     SYS_PERIPHERAL_MAIN_CLOCK_FREQUENCY
#elif CFG_APB3_DIVIDER == CFG_APB3_DIV2
  #define PCLK3_CLOCK_FREQUENCY                     (SYS_PERIPHERAL_MAIN_CLOCK_FREQUENCY / 2)
#elif CFG_APB3_DIVIDER == CFG_APB3_DIV4
  #define PCLK3_CLOCK_FREQUENCY                     (SYS_PERIPHERAL_MAIN_CLOCK_FREQUENCY / 4)
#elif CFG_APB3_DIVIDER == CFG_APB3_DIV8
  #define PCLK3_CLOCK_FREQUENCY                     (SYS_PERIPHERAL_MAIN_CLOCK_FREQUENCY / 8)
#elif CFG_APB3_DIVIDER == CFG_APB3_DIV16
  #define PCLK3_CLOCK_FREQUENCY                     (SYS_PERIPHERAL_MAIN_CLOCK_FREQUENCY / 16)
#endif

#if   CFG_APB4_DIVIDER == CFG_APB4_DIV1
  #define PCLK4_CLOCK_FREQUENCY                     SYS_PERIPHERAL_MAIN_CLOCK_FREQUENCY
#elif CFG_APB4_DIVIDER == CFG_APB4_DIV2
  #define PCLK4_CLOCK_FREQUENCY                     (SYS_PERIPHERAL_MAIN_CLOCK_FREQUENCY / 2)
#elif CFG_APB4_DIVIDER == CFG_APB4_DIV4
  #define PCLK4_CLOCK_FREQUENCY                     (SYS_PERIPHERAL_MAIN_CLOCK_FREQUENCY / 4)
#elif CFG_APB4_DIVIDER == CFG_APB4_DIV8
  #define PCLK4_CLOCK_FREQUENCY                     (SYS_PERIPHERAL_MAIN_CLOCK_FREQUENCY / 8)
#elif CFG_APB4_DIVIDER == CFG_APB4_DIV16
  #define PCLK4_CLOCK_FREQUENCY                     (SYS_PERIPHERAL_MAIN_CLOCK_FREQUENCY / 16)
#endif

