aroyer-qc/Digini/Peripheral/inc/port/STM32H7xx/lib_STM32H7_system_clock.h
#define SYSTEM_CORE_CLOCK                           SYS_HCLK_CLOCK_FREQUENCY

/// -------------------------------------------------------------------------------------------------------------------------------
/// All Peripheral frequency ( TODO need to add all module clock here. )


// CFG_PER_SOURCE_MUX
// CFG_ADC_SOURCE_MUX
// CFG_CEC_SOURCE_MUX
// CFG_DFSDM_SOURCE_MUX
// CFG_FDCAN_SOURCE_MUX
// CFG_FMC_SOURCE_MUX
// CFG_I2C123_SOURCE_MUX
// CFG_I2C4_SOURCE_MUX
// CFG_HRTIM_SOURCE_MUX
// CFG_LPTIM1_SOURCE_MUX
// CFG_LPTIM2_SOURCE_MUX
// CFG_LPTIM345_SOURCE_MUX
// CFG_LPUART1_SOURCE_MUX
// CFG_MCO1_SOURCE_MUX
// CFG_MCO2_SOURCE_MUX
// CFG_QSPI_SOURCE_MUX
// CFG_OSPI_SOURCE_MUX
// CFG_RNG_SOURCE_MUX
// CFG_RTC_SOURCE_MUX
// CFG_SAI1_SOURCE_MUX
// CFG_SAI23_SOURCE_MUX
// CFG_SAI4A_SOURCE_MUX
// CFG_SAI4B_SOURCE_MUX
// CFG_SDMMC_SOURCE_MUX
// CFG_SPDIF_SOURCE_MUX
// CFG_SPI123_SOURCE_MUX
// CFG_SPI45_SOURCE_MUX
// CFG_SPI6_SOURCE_MUX
// CFG_SWP_SOURCE_MUX

#if defined(RCC_D2CCIP2R_USART16SEL)
/// USART 1,6 clock frequency
#if   (CFG_UART16_SOURCE_MUX == CFG_USART16_PCLK2)
    #define USART16_CLOCK_FREQUENCY           PCLK2_CLOCK_FREQUENCY
  #elif (CFG_UART16_SOURCE_MUX == CFG_USART16_PLL2Q)
    #define USART16_CLOCK_FREQUENCY           PLL2Q_CLOCK_FREQUENCY
  #elif (CFG_UART16_SOURCE_MUX == CFG_USART16_PLL3Q)
    #define USART16_CLOCK_FREQUENCY           PLL3Q_CLOCK_FREQUENCY
  #elif (CFG_UART16_SOURCE_MUX == CFG_USART16_HSI)
    #define USART16_CLOCK_FREQUENCY           HSI_CLOCK_FREQUENCY
  #elif (CFG_UART16_SOURCE_MUX == CFG_USART16_CSI)
    #define USART16_CLOCK_FREQUENCY           CSI_CLOCK_FREQUENCY
  #elif (CFG_UART16_SOURCE_MUX == CFG_USART16_LSE)
    #define USART16_CLOCK_FREQUENCY           LSE_CLOCK_FREQUENCY
  #endif
  #define USART16910_CLOCK_FREQUENCY          USART16_CLOCK_FREQUENCY
#else
/// USART 1,6 clock frequency
#if   (CFG_UART16910_SOURCE_MUX == CFG_USART16910_PCLK2)
    #define USART16910_CLOCK_FREQUENCY        PCLK2_CLOCK_FREQUENCY
  #elif (CFG_UART16910_SOURCE_MUX == CFG_USART16910_PLL2Q)
    #define USART16910_CLOCK_FREQUENCY        PLL2Q_CLOCK_FREQUENCY
  #elif (CFG_UART16910_SOURCE_MUX == CFG_USART16910_PLL3Q)
    #define USART1691_CLOCK_FREQUENCY         PLL3Q_CLOCK_FREQUENCY
  #elif (CFG_UART16910_SOURCE_MUX == CFG_USART16910_HSI)
    #define USART1691_CLOCK_FREQUENCY         HSI_CLOCK_FREQUENCY
  #elif (CFG_UART16910_SOURCE_MUX == CFG_USART16910_CSI)
    #define USART16910_CLOCK_FREQUENCY        CSI_CLOCK_FREQUENCY
  #elif (CFG_UART16910_SOURCE_MUX == CFG_USART16910_LSE)
    #define USART16910_CLOCK_FREQUENCY        LSE_CLOCK_FREQUENCY
  #endif
#endif    

/// USART 1,6 clock frequency
#if   (CFG_UART16_SOURCE_MUX == CFG_USART16_PCLK2)
  #define USART16_CLOCK_FREQUENCY           PCLK2_CLOCK_FREQUENCY
#elif (CFG_UART16_SOURCE_MUX == CFG_USART16_PLL2Q)
  #define USART16_CLOCK_FREQUENCY           PLL2Q_CLOCK_FREQUENCY
#elif (CFG_UART16_SOURCE_MUX == CFG_USART16_PLL3Q)
  #define USART16_CLOCK_FREQUENCY           PLL3Q_CLOCK_FREQUENCY
#elif (CFG_UART16_SOURCE_MUX == CFG_USART16_HSI)
  #define USART16_CLOCK_FREQUENCY           HSI_CLOCK_FREQUENCY
#elif (CFG_UART16_SOURCE_MUX == CFG_USART16_CSI)
  #define USART16_CLOCK_FREQUENCY           CSI_CLOCK_FREQUENCY
#elif (CFG_UART16_SOURCE_MUX == CFG_USART16_LSE)
  #define USART16_CLOCK_FREQUENCY           LSE_CLOCK_FREQUENCY
#endif

/// USART 2,3,4,5,7,8 clock frequency
#if   (CFG_UART234578_SOURCE_MUX == CFG_USART234578_PCLK1)
  #define USART234578_CLOCK_FREQUENCY           PCLK1_CLOCK_FREQUENCY
#elif (CFG_UART234578_SOURCE_MUX == CFG_USART234578_PLL2Q)
  #define USART234578_CLOCK_FREQUENCY           PLL2Q_CLOCK_FREQUENCY
#elif (CFG_UART234578_SOURCE_MUX == CFG_USART234578_PLL3Q)
  #define USART234578_CLOCK_FREQUENCY           PLL3Q_CLOCK_FREQUENCY
#elif (CFG_UART234578_SOURCE_MUX == CFG_USART234578_HSI)
  #define USART234578_CLOCK_FREQUENCY           HSI_CLOCK_FREQUENCY
#elif (CFG_UART234578_SOURCE_MUX == CFG_USART234578_CSI)
  #define USART234578_CLOCK_FREQUENCY           CSI_CLOCK_FREQUENCY
#elif (CFG_UART234578_SOURCE_MUX == CFG_USART234578_LSE)
  #define USART234578_CLOCK_FREQUENCY           LSE_CLOCK_FREQUENCY
#endif

// CFG_USB_SOURCE_MUX                          CFG_RCC_D2CCIP2R_USB_PLL3Q

// --------------------------------------------------------------------------------------------------------------------------------
/*
// Power scaling according to speed
#if (SYS_CPU_CORE_CLOCK_FREQUENCY <= 70000000)
//#define CFG_POWER_REGULATOR                         PWR_CR1_VOS_0   // Voltage scale 3
#elif (SYS_CPU_CORE_CLOCK_FREQUENCY <= 140000000)
//#define CFG_POWER_REGULATOR                         PWR_CR1_VOS_1   // Voltage scale 2
#elif (SYS_CPU_CORE_CLOCK_FREQUENCY <= 216000000)
#define CFG_POWER_REGULATOR                         PWR_CR1_VOS     // Voltage scale 1
#endif
*/
// Flash Latency configuration for Voltage from 2.7V to 3.6V
#if   (SYS_CPU_CORE_CLOCK_FREQUENCY < 80000000)
#define CFG_FLASH_LATENCY                           FLASH_ACR_LATENCY_0WS
#elif (SYS_CPU_CORE_CLOCK_FREQUENCY < 160000000)
#define CFG_FLASH_LATENCY                           FLASH_ACR_LATENCY_1WS
#elif (SYS_CPU_CORE_CLOCK_FREQUENCY < 240000000)
#define CFG_FLASH_LATENCY                           FLASH_ACR_LATENCY_2WS
#elif (SYS_CPU_CORE_CLOCK_FREQUENCY < 320000000)
#define CFG_FLASH_LATENCY                           FLASH_ACR_LATENCY_3WS
#elif (SYS_CPU_CORE_CLOCK_FREQUENCY < 480000000)
#define CFG_FLASH_LATENCY                           FLASH_ACR_LATENCY_4WS
#else                                                                                                           // todo need to add WS for 735 up to 550MHz..
#define CFG_FLASH_LATENCY                           FLASH_ACR_LATENCY_5WS
#endif

// --------------------------------------------------------------------------------------------------------------------------------
// see page 3151 of the PDF: rm0399-stm32h745755-and-stm32h747757-advanced-armbased-32bit-mcus-stmicroelectronics.pdf
// This configuration is for MDIO with a Max frequency of 2.5 MHz (specified in the IEEE 802.3)
//
#if   (SYS_CPU_CORE_CLOCK_FREQUENCY > 155000000)
  #define ETH_MACMDIOAR_CR_DIVIDER                  ETH_MACMIIAR_CR_Div102
#elif (SYS_CPU_CORE_CLOCK_FREQUENCY > 105000000)
  #define ETH_MACMDIOAR_CR_DIVIDER                  ETH_MACMIIAR_CR_Div62
#elif (SYS_CPU_CORE_CLOCK_FREQUENCY > 65000000)
  #define ETH_MACMDIOAR_CR_DIVIDER                  ETH_MACMIIAR_CR_Div42
#elif (SYS_CPU_CORE_CLOCK_FREQUENCY > 40000000)
  #define ETH_MACMDIOAR_CR_DIVIDER                  ETH_MACMIIAR_CR_Div26
#else
  #define ETH_MACMDIOAR_CR_DIVIDER                  ETH_MACMIIAR_CR_Div16
#endif

// Verification
#if SYS_HCLK_CLOCK_FREQUENCY > MAX_SYS_HCLK
 #pragma message "XSTR(SYS_HCLK_CLOCK_FREQUENCY)"
 #error CPU Core frequency exceed maximum allowed!
#endif

#if SYS_AXI_CLOCK_FREQUENCY > MAX_SYS_AXI
 #pragma message "XSTR(SYS_APB1_CLOCK_FREQUENCY)"
 #error APB1 frequency exceed maximum allowed!
#endif


#if PCLK1_CLOCK_FREQUENCY > MAX_PCLK1
 #pragma message XSTR(PCLK1_CLOCK_FREQUENCY)
 #error PCLK1 frequency exceed maximum allowed!
#endif

#if PCLK2_CLOCK_FREQUENCY > MAX_PCLK2
 #pragma message "XSTR(PCLK2_CLOCK_FREQUENCY)"
 #error PLCK2 frequency exceed maximum allowed!
#endif

#if PCLK3_CLOCK_FREQUENCY > MAX_PCLK3
 #pragma message "XSTR(PCKL3_CLOCK_FREQUENCY)"
 #error PLCK3 frequency exceed maximum allowed!
#endif

#if PCLK4_CLOCK_FREQUENCY > MAX_PCLK4
 #pragma message "XSTR(PLCK4_CLOCK_FREQUENCY)"
 #error PCLK4 frequency exceed maximum allowed!
#endif

#if AHB4_CLOCK_FREQUENCY > MAX_AHB4
 #pragma message "XSTR(AHB4_CLOCK_FREQUENCY)"
 #error PCLK4 frequency exceed maximum allowed!
#endif

//-------------------------------------------------------------------------------------------------
// Function prototype(s)
//-------------------------------------------------------------------------------------------------

void    SystemInit              (void);

//-------------------------------------------------------------------------------------------------
